Repository: 84KaliPleXon3/weechat.org
Catalog: weechat/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: WeeChat has many new important features since some weeks: - multi-windows management (with horizontal and vertical window split) - buffers managed by number, with direct access by Alt+digit key or with new /buffer command - auto jump to buffers with activity (Alt-A) All new features are in CVS and development version. /window and /buffer commands are still under development. Feel free to report any problem or suggestion to improve navigation between buffers/windows.
pt_br: Faz algumas semanas que WeeChat possui muitas e novas características importantes: - gerenciamento multi-janelas (com divisão da janela horizontal e vertical) - buffers gerenciados por números, com acesso direto por Alt+numero ou com o novo comando /buffer - salto automático para buffers com atividade (Alt-A) Todos os novos recursos estão em CVS e versão de desenvolvimento. Comandos /window e /buffer ainda estão em desenvolvimento. Sinta-se livre para relatar qualquer problema ou sugestão para melhorar a navegação entre buffers/windows.

source: WeeChat project is started. It is a chat client, with many features like: - irc client, - many GUI: text, ncurses and gtk, - multi-platforms, - fast, light and extensible with scripts. - ...
pt_br: O projeto WeeChat é iniciado. É um cliente de bate-papo, com muitas características como: - cliente IRC, - diferentes GUI: texto, ncurses e gtk, - multi-plataforma, - rápida, leve e extensível com scripts - ...

source: WeeChat project now accepts donations via Paypal account, with secured payment.
pt_br: O projeto WeeChat agora aceita doações via conta Paypal, com pagamento seguro.

source: WeeChat screenshot
pt_br: Screenshot WeeChat

source: WeeChat scripts page
pt_br: Página de scripts do WeeChat

source: WeeChat scripts page (today Perl scripts only) has been added. On this page you can submit your script (need to be approved by WeeChat development team). Note: Perl scripts require version of WeeChat > 0.0.3, so today you must download development version.
pt_br: A página de scripts WeeChat (hoje somente scripts Perl) foi adicionada. Nesta página você pode enviar seu script (precisa ser aprovado pela equipe de desenvolvimento WeeChat). Nota: scripts Perl requerem a versão de WeeChat > 0.0.3, então hoje você deve baixar a versão de desenvolvimento.

source: WeeChat story page is now available, as screenshots. You can see differences between all versions in one view! Development version is visible too, and frequently updated.
pt_br: A página da história do WeeChat já está disponível, com fotos. Você pode ver as diferenças entre todas as versões em um só lugar! A versão de desenvolvimento é visível também, e atualizada com freqüência.

source: WeeChat users map
pt_br: Mapa de usuários do WeeChat

source: WeeChat will merge with irssi
pt_br: WeeChat irá se fundir com o irssi

source: WeeChat, the fast, light and extensible IRC client, is released for the first time, version 0.0.1. CVS is opened on Savannah page. Warning, this is still Alpha version, all IRC commands are not yet developed and lot of work is to be done. In this version, there is: - Curses front-end (other front-end are not yet developed), - almost all IRC commands from RFC1459, - multi-servers, - configuration file, - completion, commands history, - ... (see ChangeLog and TODO files) Note to people who wants to help us: - we're looking for translations for WeeChat and documentation (not written today), for example german, spanish, italian,... - we're looking too for people which knows other OS (like *BSD, GNU/Hurd, ...) to port WeeChat. All suggestions and bug reports are welcome, look at WeeChat support page for contacting us.
pt_br: WeeChat, o rápido, leve e extensível cliente de IRC, é lançado pela primeira vez, versão 0.0.1. CVS está aberto na página Savannah. Atenção, essa é ainda a versão Alpha, todos os comandos de IRC ainda não estão desenvolvidos e muito trabalho está para ser feito. Nesta versão, há: - Curses front-end (outros front-ends ainda não estão desenvolvidos), - quase todos os comandos de IRC RFC1459, - multi-servidores, - arquivo de configuração, - auto-completar, histórico de comandos, - ... (veja ChangeLog e arquivos TODO) Nota para as pessoas que querem nos ajudar: - estamos à procura de tradutores para WeeChat e documentação (não escrita hoje), por exemplo alemão, espanhol, italiano,... - nós estamos procurando muito por pessoas que conheça outro sistema operacional (como o * BSD, GNU/Hurd, ...) para porta WeeChat. Todas as sugestões e relatórios de erros são bem-vindos, olhe para a página de suporte do WeeChat para nos contatar.

source: A "now playing" script for several music players.
pt_br: Um script "reproduzindo-agora" para vários tocadores de música.

source: A common buffer for URLs.
pt_br: Um common buffer para URLs.

source: A libnotify script.
pt_br: Um script libnotify.

source: A notify script which uses ssh.
pt_br: Um script de notificar que usa ssh.

source: A now playing and control script for Quodlibet.
pt_br: Um script de reproduzindo-agora e de controle para o Quodlibet.

source: A now playing and control script for mpd.
pt_br: Um script Reproduzindo-Agora e script de controle para o mpd.

source: A now playing script for players supporting the mpris dbus interface.
pt_br: Um reproduzindo-agora para players suportando mpris dbus interface.

source: A now watching script for mplayer.
pt_br: Um script "reproduzindo-agora" para vários tocadores de música.

source: A simple auto-away script.
pt_br: Um script de auto-away simples.

source: A simple buddylist to show if your buddies are online/away/offline.
pt_br: Uma simples lista de amigos para informar se eles estão online/away/offline.

source: Add a bar item with Google weather.
pt_br: Adicionar um item de barra com o clima do Google (weather).

source: Add a bar item with the Beat-Internet-Time.
pt_br: Adicionar um item de barra com o Beat-Internet-Time.

source: Add a space between each character.
pt_br: Adiciona um espaço entre cada caractere.

source: Add alerts to the message menu in Ubuntu.
pt_br: Adicionar alertas para o menu de mensagens no Ubuntu.

source: Add an alternate timezone item.
pt_br: Adicionar um item de fuso horário alternativo.

source: Add bar item with highlight/private messages.
pt_br: Adicionar item na barra com mensagens privadas/destacadas.

source: Add bar items with plain text.
pt_br: Adiciona itens de barra com texto puro.

source: Adds HTML page titles to http:// urls in your message.
pt_br: Adiciona títulos de página HTML para http:// urls na sua mensagem.

source: Adds a channel monitor buffer.
pt_br: Adiciona um buffer para monitorar canais.

source: Adds a command and bar item for displaying the current time in kiloseconds.
pt_br: Adiciona um comando e item de barra para exibir a hora atual em kiloseconds.

source: Adds a highlight monitor buffer.
pt_br: Adiciona um buffer para monitorar destaques (highlights).

source: Adds a simple command to toggle boolean WeeChat settings.
pt_br: Adiciona um simples comando para alternar configurações boolean do WeeChat.

source: Adds effects to words surrounded by certain characters.
pt_br: Adiciona efeitos às palavras cercadas por determinados caracteres.

source: Adds wildcard support to nick completions.
pt_br: Adiciona suporte curinga para auto-completar nicks.

source: Aggregates nick highlight messages internally to be output later by command.
pt_br: Agregar mensagens com nicks destacados (hightlight) internamente, para serem exibidas depois via comando.

source: Amarok 2 control and now playing script.
pt_br: Script de controle e reproduzindo-agora para o Amarok 2.

source: Amarok 2 control and now playing script. Works locally and over SSH.
pt_br: Script de controle e de reproduzindo-agora, para o Amarok 2. Funciona localmente e através de SSH.

source: Amarok control and now playing script. Works locally and over SSH.
pt_br: Script Controle-Amarok e Reproduzindo-Agora. Funciona localmente e através de SSH.

source: An interface to Surfraw.
pt_br: Uma interface para Surfraw.

source: Announce URL title to user or to channel.
pt_br: Anunciar título da URL para o usuário ou para o canal.

source: Antispam for DCC file/chat requests.
pt_br: Antispam para pedidos de chats/arquivos DCC.

source: Auto joins channels when invited.
pt_br: Entra automaticamente nos canais quando for convidado.

source: Auto op/voice users when they join IRC channel.
pt_br: Auto op/voice quando os usuários entrarem no canal IRC.

source: Auto show and hide nicklist depending on buffer name.
pt_br: Auto mostrar/ocultar a nicklist dependendo do nome do buffer.

source: Auto-away script.
pt_br: Script auto-away.

source: Auto-join channel when "invite" is received.
pt_br: Entrar no canal quando um "invite" for recebido (Auto-join).

source: Auto-set buffer properties when a buffer is opened.
pt_br: Definir automaticamente propriedades do buffer quando ele for aberto.

source: Automatic dcc_own_ip.
pt_br: dcc_own_ip automático.

source: Automatically attempts to regain IRC primary nick.
pt_br: Tenta recuperar automaticamente o nick principal do IRC.

source: Automatically change IRC modes of other users when they join.
pt_br: Alterar automaticamente os modos de IRC dos usuários quando eles entrarem.

source: Automatically close inactive private message buffers.
pt_br: Fechar automaticamente buffers inativos de mensagens privada.

source: Automatically join channels on UnderNET that get throttled due to "Target change too fast".
pt_br: Automaticamente junta canais na UnderNET que são limitados devido à "Target change too fast".

source: Automatically op and voice some nicks.
pt_br: Dê op e voice automaticamente a alguns nicks.

source: Autoresponse script.
pt_br: Script de auto-resposta.

source: Avoid sending misformatted commands as messages.
pt_br: Evita enviar comandos mal formatados como mensagens.

source: Bar item showing typing count and cursor position.
pt_br: Item na barra mostrando contagem de digitação e a posição do cursor.

source: Bar item with HTTP source.
pt_br: Item de barra com fonte HTTP.

source: Bar item with chatters (non idle people).
pt_br: Item de barra com conversantes (pessoas não inativas).

source: Bar item with scroll indicator and info about number of lines in buffer.
pt_br: Item de barra com indicador de rolagem e informação sobre número de linhas no buffer.

source: Bar item with unread imap messages count.
pt_br: Item na barra com contagem de mensagens imap não lidas.

source: Bar items with stats about network interface, load, and free memory.
pt_br: Itens na barra com estatísticas sobre a interface de rede, carga e memória livre.

source: Bar with popup menu.
pt_br: Barra com menu popup.

source: Basic MPD management.
pt_br: Gerenciamento MPD básico.

source: Beep (terminal bell) or run command on highlight/private message.
pt_br: Beep no alto-falante ao receber mensagens privadas/highlights.

source: Block mass highlights.
pt_br: Bloqueia destaques em massa.

source: Browse/list URLs in channels.
pt_br: Listar/navegar nas URLs dos canais.

source: Charset replacement for IRC, recode past message.
pt_br: Substituição de charset para IRC, recodifica mensagem passada.

source: Check POP3 server for mails and display mail headers.
pt_br: Verifique e-mails no servidor POP3 para exibir cabeçalhos dos e-mails.

source: Collects all URLs said in a channel, and launches them in your web browser.
pt_br: Recolhe todas as URLs faladas no canal, e lança-las no seu navegador web.

source: Color the channel text with nick color.
pt_br: Colorize o texto do canal com a cor do nick.

source: Command queuing.
pt_br: Enfileirar comandos.

source: Complete empty input line with latest speaker nick in channel.
pt_br: Completa linha de entrada vazia com o nick do mais recente orador no canal.

source: Configure autojoin for all servers according to currently joined channels.
pt_br: Configure autojoin para todos os servidores de acordo com os canais já participados.

source: Contextual command line help.
pt_br: Ajuda de linha de comando contextual.

source: Control Rhythmbox through qdbus.
pt_br: Controla Rhythmbox por qdbus.

source: Control and now playing script for ncmpcpp.
pt_br: Script de controle e reproduzindo-agora para ncmpcpp.

source: Control and now-playing script for cmus.
pt_br: Script de controle e reproduzindo-agora para cmus.

source: Control and now-playing script for moc.
pt_br: Script de controle e reproduzindo-agora para moc.

source: Convert text to leet.
pt_br: Converter texto em leet.

source: Correction for misspelled words in command line.
pt_br: Correção para palavras erradas na linha de comando.

source: Current song script for Spotify on OS X.
pt_br: Script de reproduzindo-agora para Spotify no OS X.

source: Custom word completions.
pt_br: Auto-completar palavras customizadas.

source: Customizable kickban command with unban timer and mask resolver.
pt_br: Comando kickban personalizável com unban, timer e mask resolver.

source: Customize answers to CTCP requests.
pt_br: Personalize respostas aos pedidos CTCP.

source: Customize bars by buffer.
pt_br: Personalize barras por buffer.

source: Cycle to currently used server (for merged buffers).
pt_br: Circula para o servidor utilizado atualmente (para buffers mesclados).

source: Debugging tool for python scripts or test WeeChat's API functions.
pt_br: Ferramenta de depuração para scripts python ou teste das funções API do WeeChat.

source: Delete log file of current buffer.
pt_br: Excluir arquivo de log do ​​buffer atual.

source: Delete log files by age or size.
pt_br: Excluir arquivos de log, por idade ou tamanho.

source: Detect multiple nicknames from the same host on irc channels.
pt_br: Detectar múltiplos apelidos a partir do mesmo host nos canais de irc.

source: Display JOIN message to open query if buddy comes back to &bitlbee channel.
pt_br: Exibir mensagem JOIN para abrir query se o amigo voltar para o canal &bitlbee.

source: Display WeeChats infos, useful for script developers.
pt_br: Mostrar WeeChat infos, útil para desenvolvedores de scripts.

source: Display Weechat highlights in dzen (and beep).
pt_br: Mostrar highlights do weechat no dzen (e beep).

source: Display a url bar for easy clicking or selecting.
pt_br: Exibir uma barra de urls para clicar ou selecionar facilmente.

source: Display content of viedemerde.fr/fmylife.com website.
pt_br: Exibir o conteúdo do website viedemerde.fr/fmylife.com.

source: Display corrected text when user sends s/typo/replacement.
pt_br: Exibe texto corrigido quando usuário envia s/erro/substituição.

source: Display external ip address.
pt_br: Exibição do endereço de ip externo.

source: Display infolist in a buffer, useful for script developers.
pt_br: Mostrar infolist em um buffer, útil para desenvolvedores de scripts.

source: Display latest available kernel on kernel.org.
pt_br: Mostra o kernel mais recente disponível no kernel.org.

source: Display list of open buffers in infobar.
pt_br: Visualização na infobar da lista de buffers abertos.

source: Display machine uptime.
pt_br: Mostrar uptime da máquina.

source: Display name days in bar item and buffer (only french calendar).
pt_br: Exibe nome dos dias na barra de item e buffer (apenas para o calendário francês).

source: Display old topics for a channel.
pt_br: Mostrar tópicos antigos de um canal.

source: Display right-to-left text in chat with fribidi.
pt_br: Exibe texto da direita para esquer na conversa com fribidi.

source: Display size of current log file in a bar item.
pt_br: Exibe tamanho do arquivo de log atual em um item de barra.

source: Display weather from Google.
pt_br: Mostrar a meteorologia do Google.

source: Display which song Audacious is currently playing.
pt_br: Mostrar qual música o Audacious está reproduzindo atualmente.

source: Display which song Rhythmbox is currently playing.
pt_br: Mostrar que canção está tocando atualmente no Rhythmbox.

source: Display which song clementine is currently playing.
pt_br: Mostrar qual canção clementine está reproduzindo atualmente.

source: Display which song exaile is currently playing.
pt_br: Mostrar qual canção exaile está reproduzindo atualmente.

source: Display which song mp3blaster is currently playing.
pt_br: Mostrar qual canção o mp3blaster está reproduzindo atualmente.

source: Display which song mpd is currently playing.
pt_br: Mostrar qual música o mpd está reproduzindo atualmente.

source: Display which song rhythmbox is currently playing.
pt_br: Mostrar qual canção o rhythmbox está reproduzindo atualmente.

source: Display which song xmms is currently playing.
pt_br: Mostrar qual canção xmms está reproduzindo atualmente.

source: Display which song xmms2 is currently playing.
pt_br: Mostrar que canção o xmms2 está reproduzindo atualmente.

source: Displays channel's peak, low and average users.
pt_br: Exibe estatísticas do numero de usuários no canal (mínimo, médio e máximo).

source: Displays network interface bandwidth on a bar.
pt_br: Mostra numa barra a largura de banda da interface de rede.

source: Displays sensor data.
pt_br: Exibe os dados dos sensores.

source: Displays the current playing track from Orpheus in current channel.
pt_br: Exibe a atual reprodução da faixa do Orpheus no canal atual.

source: Displays the last few log lines at the start of each new buffer.
pt_br: Exibe as últimas poucas linhas do log no início de cada novo buffer.

source: Do funny things with your input and enerve others.
pt_br: Faz coisas engraçadas com os seus dados e enerve os outros.

source: Edit channel topics by perl regular expressions or in input-line.
pt_br: Editar tópico dos canais usando expressões regulares perl ou in input-line.

source: Encrypt/decrypt messages using openssl.
pt_br: Criptografar/decriptografar mensagens usando openssl.

source: Execute command on all irc query buffers.
pt_br: Executar o comando em todos os buffers de consulta irc.

source: Execute commands on screen attach/detach.
pt_br: Executar comandos na tela attach/detach.

source: Execute perl code with a command or in a buffer.
pt_br: Executar código perl com um comando ou em um buffer.

source: Execute the command and print it to the actual buffer or server.
pt_br: Executar o comando e imprimi-lo para o atual buffer ou servidor.

source: Expand short URLs.
pt_br: Expandir URLs curtas.

source: Extends /filter, help against spam.
pt_br: Estende /filter, ajuda contra spam.

source: Fetches your last submitted song from last.fm and shows it in the current channel.
pt_br: Busca a sua última canção apresentada a partir de last.fm e mostra-a no canal atual.

source: FiSH encryption/decryption.
pt_br: Criptografia/decriptografia FiSH.

source: Flood'it game.
pt_br: Jogo Flood'it.

source: Forces original nickname and wipes out ghosts and nick stealers.
pt_br: Forçar nickname original e apaga fantasmas e ladrões de nick.

source: Format identi.ca bot messages.
pt_br: Formata mensagens do Bot identi.ca.

source: Format the output of each line.
pt_br: Formata a saída de cada linha.

source: Forward DCC SEND requests to a different client.
pt_br: Encaminha requisições DCC SEND para um cliente diferente.

source: Freenode memo notifications.
pt_br: Notificações e memorandos do Freenode.

source: Generate a file with highlights for external programs as conky.
pt_br: Gera um arquivo com destaques para programas externos como o conky.

source: Generate a list of nicks in input by selecting nicks using flags and patterns.
pt_br: Gera uma lista de apelidos na entrada selecionando apelidos usando flags e padrões.

source: Get "tinyurl.com" equivalent for URLs.
pt_br: Obtém equivalente "tinyurl.com" para URLs.

source: Give hotlist to an external file/program.
pt_br: Passe a hotlist para um programa/arquivo externo.

source: Growl notification script.
pt_br: Growl script de notificação.

source: Growl notifications using python-gntp.
pt_br: Notificações Growl usando python-gntp.

source: Growl notifications using ruby-gntp.
pt_br: Notificações Growl usando ruby-gntp.

source: Helper script for IRC channel operators.
pt_br: Helper script para operadores de canais de IRC.

source: Highlight some channels on each message.
pt_br: Destacar alguns canais em cada mensagem.

source: Insert some statistics about buffers/windows on command line.
pt_br: Insere algumas estatísticas sobre buffers/janelas na linha de comando.

source: Interpret mirc formatting codes in the command line and show a color popup when needed.
pt_br: Interpreta códigos de formatação mirc na linha de comando e mostra um popup de cores quando necessário.

source: IrssiNotifier push notifications with end-to-end encryption.
pt_br: IrssiNotifier envia notificações com criptografia de fim-a-fim.

source: Jabber's notification on highlight and private message.
pt_br: Notificação via Jabber ao receber uma mensagem privada e destacada.

source: Jabber/XMPP protocol.
pt_br: Protocol Jabber/XMPP.

source: Keep your nick and recover it in case it's stolen.
pt_br: Mantenha o seu nick e recupere-o caso seja roubado.

source: Kickban nick and unban after some seconds.
pt_br: Kickban nick e unban depois de alguns segundos.

source: Launch external commands for signals.
pt_br: Lançar comandos externos para sinalizações (signals).

source: Less ordinary abuse generator.
pt_br: Gerador de abusos/insultos.

source: Let users send you assignments that will be put into a file.
pt_br: Permitir os usuários enviar-lhe atribuições que serão colocadas em um arquivo.

source: Lock input (authorize only commands).
pt_br: Bloqueio de entrada (apenas comandos autorizados).

source: Log URLs to a SQL Database.
pt_br: Registra (Log) URLs para um banco de dados SQL.

source: Log highlights/private msg when you are away.
pt_br: Registra (Log) msgs privadas/highlights quando você estiver away.

source: Logs url and open them in browser.
pt_br: Pegue a url e então abra-a no navegador.

source: Looks for text in WeeChat disk log files.
pt_br: Procura texto em arquivos WeeChat de log em disco.

source: Looks up meta information about spotify-URIs and posts back to channel.
pt_br: Procura meta information sobre spotify-URIs e envia de volta para o canal.

source: Magic 8 Ball.
pt_br: Bola 8 Mágica.

source: Make xterm clipboard paste available as command.
pt_br: Faz a área de transferencia do xterm disponível como comando.

source: Manage feasts from french calendar.
pt_br: Gerenciar as festas do calendário francês.

source: Mastermind game.
pt_br: Jogo Mastermind.

source: Minesweeper game.
pt_br: Jogo Minesweeper.

source: Monitoring of highlights/tags/buffers/nicks with sound/osd notifications.
pt_br: Monitoramento dos destaques, tags, buffers, nicks com notificações opcionais para som e osd.

source: Multi-line edit box, also supports editing of multi-line pastes.
pt_br: Caixa de edição multi linha, também suporta edição de colações multi linha.

source: Netsoul protocol.
pt_br: Protocolo Netsoul.

source: New hotlist, use names and keybindings instead of numbers.
pt_br: Nova hotlist, use names e combinações de teclas em vez de números.

source: Notification on screen for highlights and private messages.
pt_br: Notificações na tela para mensagens privadas e destacadas.

source: Notification script using libnotify or dbus with screen support.
pt_br: Script de notificação usando libnotify ou dbus com suporte ao screen.

source: Notifications for twmn.
pt_br: Notificações do twmn.

source: Notifications of private messages, highlights, DCC send/receive and more.
pt_br: Notificações de mensagens privadas, destaques, envios/recebimentos DCC e mais.

source: Notifications on iPod Touch/iPhone/iPad with Prowl.
pt_br: Envie notificações para iPod touch/iPhone com Prowl.

source: Notifications through Growl.
pt_br: Notificações através de Growl.
