Repository: 84KaliPleXon3/weechat.org
Catalog: weechat/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: 256 colors, irc proxy, rmodifier, redirection of irc commands.
pt_br: 256 cores, proxy de irc, rmodifier, redirecionamento de comandos irc.

source: Aspell plugin.
pt_br: Plugin aspell.

source: Command /eval, aspell suggestions, IPv6 in relay, irc backlog in relay.
pt_br: Comando /eval, sugestões ortográficas, IPv6 no retransmissor, backlog irc no retransmissor.

source: Dcc chat and file, fifo plugin.
pt_br: Arquivos e bate-papo dcc, plugin fifo.

source: Dynamic allocation and attributes for colors.
pt_br: Alocação dinâmica e atributos para cores.

source: First line of code.
pt_br: Primeira linha de código.

source: First version.
pt_br: Primeira versão.

source: Full UTF-8 support.
pt_br: Suporte completo para utf-8.

source: Guile plugin, support of python 3.x, weechat protocol in relay (remote interfaces), URL transfer in API.
pt_br: Plugin guile, suporte à python 3.x, protocolo weechat no retransmissor (interfaces remotas), transferência de URL na API.

source: Incremental text search in buffers.
pt_br: Pesquisa incremental de texto em buffers.

source: Last version before a major rewrite of WeeChat.
pt_br: Última versão antes de uma grande reformulação do WeeChat.

source: Lua plugin.
pt_br: Plugin lua.

source: Mouse support, cursor mode.
pt_br: Suporte ao mouse, modo de cursor.

source: Multiple layouts, auto-unmask IRC joins, WebSocket support in relay.
pt_br: Múltiplos esquemas, desmascaração automática de afiliamento IRC, suporte à WebSocket no repetidor.

source: New site weechat.org, major rewrite of WeeChat with new plugin API, tcl plugin.
pt_br: Novo site weechat.org, grande reformulação do WeeChat com nova API plugin, tcl plugin.

source: Perl plugin.
pt_br: Plugin perl.

source: Plugin "script" (scripts manager), SSL in relay.
pt_br: Plugin "script" (gerenciador de scripts), SSL no retransissor.

source: Proxy support, IPv6, SSL.
pt_br: Suporte para proxy, ipv6, SSL.

source: Python plugin.
pt_br: Plugin python.

source: Ruby plugin.
pt_br: Plugin ruby.

source: SASL authentication.
pt_br: Autenticação SASL.

source: stable version
pt_br: versão estável

source: stable version, as number, like plugin API: info_get("version_number")
pt_br: versão estável, como número, como plugin da API: info_get("version_number")

source: date of stable version
pt_br: data da versão estável

source: development version
pt_br: versão de desenvolvimento

source: output of "git rev-parse HEAD" for sources repository
pt_br: saída de "git rev-parse HEAD" para o repositório de fontes

source: output of "git rev-parse HEAD" for scripts repository
pt_br: saída de "git rev-parse HEAD" para o repositório scripts

source: next stable version
pt_br: próxima versão estável

source: next stable version, as number, like plugin API: info_get("version_number")
pt_br: próxima versão estável, como número, como plugin da API: info_get("version_number")

source: approximate date of next stable version
pt_br: data aproximada da próxima versão estável

source: all infos (one info by line, format: "info:value")
pt_br: todas as informações (uma informação por linha, formato: "info:value")

source: Czech
pt_br: Tcheco

source: German
pt_br: Alemão

source: English
pt_br: Inglês

source: Spanish
pt_br: Espanhol

source: French
pt_br: Francês

source: Hungarian
pt_br: Húngaro

source: Italian
pt_br: Italiano

source: Japanese
pt_br: Japonês

source: Polish
pt_br: Polonês

source: Portuguese (Brazil)
pt_br: Portugues (Brasil)

source: Russian
pt_br: Russo

source: Turkish
pt_br: Turco

source: FAQ
pt_br: Perguntas Frequentes

source: User's guide
pt_br: Guia do usuário

source: Plugin API reference
pt_br: Referência da API do plugin

source: Scripting guide
pt_br: Guia para fazer scripts

source: Quick Start guide
pt_br: Guia de Início Rápido

source: Tester's guide
pt_br: Guia dos Testadores

source: Developer's guide
pt_br: Guia dos Developer's

source: Relay protocol
pt_br: Protocolo de retransmissão

source: Buffer overflow when decoding IRC colors in strings.
pt_br: Buffer overflow durante a decodificação de strings de cores de IRC.

source: Buffer overflows in build of strings.
pt_br: Buffer overflows na construção de strings.

source: Crash when receiving special chars in IRC messages.
pt_br: Falha durante o recebimento de caracteres especiais em mensagens IRC.

source: Do not use command /notify with nicks containing formatting chars like "%".
pt_br: Não use o comando /notify com apelidos contendo caracteres de formatação como "%".

source: Do not use irc protocol in relay plugin.
pt_br: Não use o protocolo irc no plugin de retransmissão.

source: Missing verifications in SSL certificate, which allows man-in-the-middle attackers to spoof an SSL chat server via an arbitrary certificate.
pt_br: Ausência de verificação de certificados SSL, o que permite que atacantes man-in-the-middle enganem um servidor de chat com SSL através de um certificado arbitrário.

source: Remove/unload all scripts calling function hook_process (for maximum safety).
pt_br: Remove/descarrega todos os scripts chamando a função hook_process (para segurança máxima).

source: Turn off option "irc.network.send_unknown_commands" or do not use formatting chars like "%" when sending unknown commands to server.
pt_br: Desabilite a opção "irc.network.send_unknown_commands" ou não use caracteres de formatação como "%" quando enviar comandos desconhecidos ao servidor.

source: Uncontrolled format string in API function infobar_printf.
pt_br: String de formato descontrolada na função de API infobar_printf.

source: Uncontrolled format string when IRC commands are redirected by relay plugin. If the output or redirected command contains formatting chars like "%", this can lead to a crash of WeeChat.
pt_br: String de formato descontrolada quando comandos IRC são redirecionados pelo plugin de retransmissão. Se a saída ou comando redirecionado contém caracteres formatantes como "%", isto pode levar à falha do WeeChat.

source: Uncontrolled format string when sending IRC "ison" command for nicks monitored with command /notify.
pt_br: String de formato descontrolada quando enviando comandos IRC "ison" para apelidos monitorados com o comando /notify.

source: Uncontrolled format string when sending unknown IRC command to server (if option "irc.network.send_unknown_commands" is on).
pt_br: String de formato incontrolada quando enviando um comando IRC desconhedico para o servidor (se a opção "irc.network.send_unknown_commands" está habilitada).

source: Untrusted command for function hook_process could lead to execution of commands, because of shell expansions (so the problem is only caused by some scripts, not by WeeChat itself).
pt_br: Comandos não confiáveis para a função hook_process podem levar à execução de commandos, devido às expansões de shell (então o problema somente é causado por alguns scripts, não pelo WeeChatem si).

source: low
pt_br: baixo

source: medium
pt_br: médio

source: high
pt_br: alto

source: critical
pt_br: crítico

source: 10th birthday for WeeChat! Happy birthday!
pt_br: 10º aniversário para o WeeChat! Feliz aniversário!

source: <a href="http://en.wikipedia.org/wiki/Dennis_Ritchie">Dennis Ritchie</a>, creator of the C programming language, and key developer of the Unix operating system has died. WeeChat is written in C, and runs on derivatives of Unix. So we just say a big thank you to you, Dennis, for your wonderful job.
pt_br: <a href="http://en.wikipedia.org/wiki/Dennis_Ritchie">Dennis Ritchie</a>, criador da linguagem de programação C, e desenvolvedor chave do sistema operacional Unix morreu. WeeChat é escrito em C, e roda em derivados do Unix. Então, nós apenas falamos um grande obrigado a você, Dennis, pelo seu trabalho maravilhoso.

source: A Raspbian repository has been added for Raspberry Pi (thanks to Nils G. for building the packages every night). The existing Debian repositories have been moved from flashtux.org to weechat.org, like the new Raspbian one. A new section has been added on download page with a summary of all repositories: <a href="/download/debian/">Debian/Raspbian repositories</a>.
pt_br: Um repositório para o Raspbian foi adicionado para o Raspberry Pi (agradecimentos ao Nils G. pela construção dos pacotes toda noite). Os repositórios Debian existente foram movidos de flashtux.org para weechat.org, como os novos de Raspbian. Uma nova seção foi adicionada na página de download com um sumário de todos os repositórios: <a href="/download/debian/">Debian/Raspbian repositories</a>.

source: A map of developers, contributors and users is now available. Everybody is invited to add nick/location to this map.
pt_br: Um mapa de desenvolvedores, colaboradores e usuários já está disponível. Todos estão convidados para adicionar nick/localização para este mapa.

source: A new blog about WeeChat development has been added. It announces all new features in development version and let you discuss about future of WeeChat. Feel free to read it and add comments!
pt_br: Um novo blog sobre o desenvolvimento do WeeChat foi adicionado. Ele anuncia todos os novos recursos em desenvolvimento para a presente versão e permite a você discutir sobre o futuro do WeeChat. Sinta-se livre para lê-lo e adicionar comentários!

source: A new mailing list has been added for the security advisories. To be warned immediately when a security vulnerability is found in WeeChat, just <a href="https://lists.nongnu.org/mailman/listinfo/weechat-security">subscribe to the list</a>.
pt_br: Uma nova lista de emails foi adicionada para os avisos de segurança. Para ser avisado imediatamente quando uma vulnerabilidade de segurança é encontrada no WeeChat, apenas <a href="https://lists.nongnu.org/mailman/listinfo/weechat-security">inscreva-se na lista</a>.

source: After discussion with irssi developers, both projects are going to merge in the next weeks. Most of WeeChat features will not be available in first merged versions, but they will be in a few months. This merge will give missing features to WeeChat and give new from irssi. WeeChat developers will not take part into final client (which should be renamed to "weerssi"). Update: it is of course an april joke :-)
pt_br: Após discussão com os desenvolvedores do irssi, ambos os projetos vão se fundir nas próximas semanas. A maioria das características WeeChat não estará disponível nas primeiras versões da fusão, mas será por poucos meses. Esta fusão vai dar as características que faltavam para o WeeChat e dará um novo irssi. Desenvolvedores do WeeChat não terão participação no cliente final (que deve ser renomeado para "weerssi "). Obs: É claro que é uma piada de primeiro de abril :-)

source: An important refresh has been made for site weechat.org: new design, and new logo! Hope you enjoy the new version :)
pt_br: Uma importante atualização foi feita para o site weechat.org: novo design, e novo logotipo! Espero que você goste da nova versão :)

source: As a Christmas gift, a new major feature of WeeChat is now available: support of 256 colors! It is available in git repository, or in devel package with version 0.3.4-rc2. The future version 0.3.4 will bring major features like: - 256 colors - irc proxy (relay plugin) - redirection of IRC commands - command /notify - rmodifier plugin - regular expressions for highlights - and much more! We wish you happy Christmas and happy new year with WeeChat! See you in 2011 for version 0.3.4 :-)
pt_br: Como um presente de Natal, um novo recurso importante do WeeChat já está disponível: o suporte a 256 cores! Ele está disponível no repositório git, ou no pacote devel da versão 0.3.4-rc2. A futura versão 0.3.4 trará como principais características: - 256 cores - Irc proxy (relay plugin) - redirecionamento de comandos IRC - comando /notify - plugin rmodifier - expressões regulares com destaques - e muito mais! Desejamos-lhe feliz Natal e feliz ano novo com WeeChat! Vê-lo-ei em 2011 para a versão 0.3.4 :-)

source: Bugs have been detected with WeeChat 0.2.2: for servers using charsets like KOI8-R. When nicks are encoded with cyrillic chars, WeeChat doesn't decode them, and display and behaviour with server are buggy. If you use KOI8-R (or charsets like this one), we recommend you to use version 0.2.1 or development version. If you use only UTF-8 or ISO charsets, there's no problem with version 0.2.2. These problems are fixed in development version. A new version will be available soon, it will fix all problems.
pt_br: Bugs foram detectados com WeeChat 0.2.2: para servidores usando charsets como KOI8-R. Quando nicks são codificados com caracteres cirílicos, o WeeChat não decodificará, e exibirá com comportamento do servidor são buggy. se você usar KOI8-R (ou charsets como este), recomendamos que você use a versão 0.2.1 ou a versão desenvolvimento. se você usar apenas UTF-8 ou ISO charsets, não haverá problema com a versão 0.2.2. Esses problemas estão resolvidos na versão de desenvolvimento. A nova versão estará disponível em breve, ela vai corrigir todos os problemas.

source: Bugs with version 0.2.2
pt_br: Bugs com a versão 0.2.2

source: Checksum (SHA1, 160-bit) is now displayed for source packages and some binary packages on download page. GPG signature is available for each stable release (the two source packages). You can find instructions to verify packages on download page. This should help you to verify that downloaded packages have not be corrupted in any way.
pt_br: Checksum (SHA1, 160-bit) é exibido para pacotes de fontes e alguns pacotes binários na página de download. Assinaturas GPG estão disponíveis para cada lançamento estável (os dois pacotes de fontes). Você deve encontrar instruções para verificar os pacotes na página de downloads. Isto deve ajudá-lo a verificar que os pacotes baixados não estão corrompidos de alguma forma.

source: Checksum and GPG signature
pt_br: Checksum e assinatura GPG

source: Christmas gift: <a href="/download/devel">QWeeChat</a>, the first remote interface for WeeChat. It is written in Python, using Qt toolkit. Note that this is an alpha version of this interface, many features are missing. More info and screenshot are on <a href="http://dev.weechat.org/post/2011/12/25/QWeeChat-Python-Qt-GUI">development blog</a>. Merry Christmas and happy new year 2012 with WeeChat and QWeeChat!
pt_br: Presente de natal: <a href="/download/devel">QWeeChat</a>, a primeira interface remota para o WeeChat. Escrita em python com Qt. Note que é uma versão alfa desta interface, muitas características estão faltando. Mais informações e imagens no <a href="http://dev.weechat.org/post/2011/12/25/QWeeChat-Python-Qt-GUI">blog de desenvolvimento</a>. Feliz Natal e feliz 2012 com WeeChat e QWeeChat!

source: Debian/Raspbian repositories
pt_br: Repositórios Debian/Raspbian

source: Devel blog
pt_br: Blog de desenvolvimento

source: Development of Jabber plugin for WeeChat has started and a first alpha version is available. Note: many features are missing, like TLS connection, buddy list management, presence information, MUC and transports.
pt_br: Desenvolvimento do plugin Jabber para WeeChat já começou, e uma versão alfa está disponível. Nota: muitos recursos estão faltando, como conexão TLS, gerenciamento de lista de amigos, informações de presença, MUC e transportes.

source: Documentation
pt_br: Documentação

source: First WeeChat screenshot is available (version with ncurses interface). This chat client is under development, first stable version will be available soon. Thanks for your patience...
pt_br: Primeira screenshot do WeeChat está disponível (versão com interface ncurses). Este cliente de bate-papo está em desenvolvimento, primeira versão estável estará disponível em breve. Obrigado pela sua paciência...

source: First release candidate (version 0.3.0-rc1) for future version 0.3.0 is available. No major feature will be added until version 0.3.0 will be released.
pt_br: Primeiro release candidate (versão 0.3.0-rc1) para a futura versão 0.3.0 está disponível. Nenhuma característica importante será adicionada até a versão 0.3.0 ser lançada.

source: First version of WeeChat users guide is available. Many formats: PDF, html, text and texinfo (source document). Note: this documentation is not finished and we're still looking for translators, feel free to contact us ;)
pt_br: Primeira versão do guia do usuário WeeChat está disponível. Em vários formatos: PDF, html, texto e texinfo (documento fonte) Nota: esta documentação não está terminada ainda, e estamos à procura de tradutores, não hesite em contactar-nos ;)

source: Happy birthday WeeChat, 10 years old!
pt_br: Feliz aniversário WeeChat, 10 anos de idade!

source: Happy colorful Christmas with WeeChat!
pt_br: Feliz Natal colorido com WeeChat!

source: IPv6 for weechat.org
pt_br: IPv6 para weechat.org

source: IRC Client WeeChat is under development, a new screenshot is available: nick list and window for each channel. This version is still unstable and doesn't implement all IRC commands. Current developments are: - IRC protocol, - configuration file management, - ncurses front-end (color display, window management), - Gtk+ and Qt front-ends.
pt_br: O cliente de IRC, WeeChat, está em desenvolvimento, uma imagem nova está disponível: nicklist e janela para cada canal. Esta versão ainda é instável e não implementa todos os comandos de IRC. Desenvolvimentos atuais são: - protocolo IRC, - gerenciamento de arquivos de configuração, - ncurses front-end (display colorido, gerenciamento de janelas), - Gtk+ e Qt front-ends.

source: Jabber plugin
pt_br: plugin Jabber

source: Mailing list for security advisories
pt_br: Lista de emails para avisos de segurança

source: Major new features
pt_br: Principais novos recursos

source: New WeeChat screenshot
pt_br: Screenshot WeeChat novo

source: New design for weechat.org
pt_br: Novo design para weechat.org

source: News about development
pt_br: Notícias sobre o desenvolvimento

source: Next WeeChat version (codename "revolution") is under development. Large part of code was rewritten, it's now faster, easier, and more extensible. List of new features and screenshots can be found on wiki page (see link below). Today there's no planed release date, some features are still missing, and there's lot of work until a stable version. We need help, like beta testers, to test this version. You can look at wiki page for more info. To be continued in some months for other news...
pt_br: A próxima versão do WeeChat (codinome "revolution") está em desenvolvimento. Grande parte do código foi reescrito, esta mais rápido agora, mais fácil e mais extensível. Lista de novas funcionalidades e fotos podem ser encontradas na página wiki (veja link abaixo). Hoje não há data de lançamento planejada, alguns recursos ainda estão faltando, e ainda há muito trabalho até uma versão estável. Precisamos de ajuda de testadores (beta testers), para testar esta versão. Você pode olhar para página wiki para mais informações. Para ser continuado em alguns meses para outras notícias...

source: Paypal donations
pt_br: Doações Paypal

source: Second release candidate (version 0.3.0-rc2) for future version 0.3.0 is available.
pt_br: Segundo release candidate (versão 0.3.0-rc2) para a futura versão 0.3.0 está disponível.

source: Site weechat.org and all subdomains are now accessible via IPv6.
pt_br: Site weechat.org e todos os subdomínios agora acessíveis via IPv6.

source: Story... with screenshots
pt_br: História... com fotos

source: The version is expected on this date. More info in the <a href="/dev/roadmap/">roadmap</a>.
pt_br: A versão é esperada nesta data. Mais informaçoes no <a href="/dev/roadmap/">plano de desenvolvimento</a>.

source: Third release candidate (version 0.3.0-rc3) for future version 0.3.0 is available.
pt_br: Terceiro release candidate (versão 0.3.0-rc3) para a futura versão 0.3.0 está disponível.

source: Version
pt_br: Versão

source: Version 0.0.2 is available! News since last version are: - added commands /rehash and /restart - command &amp; auto-join channels when connected to server - new commands for alias: /alias, /unalias (new section in config file) - config is now saved automatically when quitting WeeChat, /save command added - new commands for servers: /server, /connect, /disconnect - added autoconnect flag for each server in config file - added "look_set_title" option in config file - term window title is modified with WeeChat name and version - CTCP version returns more info (about OS) - many bugs fixed (including nicklist display bug).
pt_br: A versão 0.0.2 está disponível! Notícias desde a última versão são: - adicionado comandos /rehash e /restart - comando &amp; auto-join de canais quando conectado ao servidor - novos comandos para alias: /alias, /unalias (nova seção no arquivo de configuração) - config agora é salvo automaticamente ao sair do WeeChat, comando /save adicionado - novos comandos para os servidores: /server, /connect, /disconnect - adicionado flag de autoconnect para cada servidor no arquivo de configuração - adicionado opção "look_set_title" no arquivo de configuração - título da janela do terminal é modificado com o nome e versão WeeChat - versão CTCP retorna mais informações (sobre o OS) - muitos bugs corrigidos (incluindo bug de exibição da nicklist).

source: Version 0.0.3 is available! News since last version are: - script ./configure to build WeeChat - french translation - new commands: stats, service, squit, motd, lusers, links, time, trace, admin, info, servlist, squery, who, whowas, die, summon, users, wallops, userhost, ison, ctcp ping - many bugs fixed.
pt_br: A versão 0.0.3 está disponível! Notícias desde a última versão são: - script ./configure para compilar o WeeChat - tradução para francês - novos comandos: stats, service, squit, motd, lusers, links, time, trace, admin, info, servlist, squery, who, whowas, die, summon, users, wallops, userhost, ison, ctcp ping - muitos bugs corrigidos.

source: Version 0.0.4 is available! News since last version are: - Perl scripts support, with auto-load - highlight - Ctrl-C now intercepted (ignored) - debug messages can be enabled via ./configure --enable-debug option - many bugs fixed.
pt_br: A versão 0.0.4 está disponível! Notícias desde a última versão são: - suporte a scripts Perl, com carregamento automático - textos destacados (highlight) - Ctrl-C agora interceptados (ignorados) - mensagens de depuração podem ser ativadas via opção ./configure --enbale-debug - muitos bugs corrigidos.

source: Version 0.0.5 is available! News since last version are: - info bar with highlight from other channels, can be modified by Perl scripts - /set command (configuration can be modified while WeeChat is running) - new command line parameter: "-c" to see config options - nick is now un*x username in default config - secured code to prevent any buffer overflow - many bugs fixed.
pt_br: A versão 0.0.5 está disponível! Notícias desde a última versão são: - barra de informações com destaque de outros canais, podem ser modificados por scripts Perl - comando /set (configuração pode ser modificada enquanto WeeChat está funcionando) - novo parâmetro de linha de comando: "-c" para ver as opções de configuração - nick agora é o nome do usuário un*x na config padrão - código protegido para evitar qualquer buffer overflow - muitos bugs corrigidos.
