Repository: 84KaliPleXon3/weechat.org
Catalog: weechat/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Version 0.2.6.1 is available. This release fixes a crash when receiving some special chars in IRC messages. It is strongly recommended to upgrade to this version for all users of version 0.2.6 (versions 0.2.5 or older are not affected by this bug).
pt_br: A versão 0.2.6.1 está disponível. Esta versão corrige uma falha ao receber alguns caracteres especiais nas mensagens de IRC. É altamente recomendável a atualização para esta versão para todos os usuários da versão 0.2.6 (versões 0.2.5 ou mais velhos não são afetados por esse bug).

source: Version 0.2.6.2 is available. This release fixes a charset decoding problem of version 0.2.6.1.
pt_br: A versão 0.2.6.2 está disponível. Esta versão corrige um problema de decodificação de charset da versão 0.2.6.1.

source: Version 0.2.6.3 is available. This release fixes a bug with detection of gnutls.
pt_br: A versão 0.2.6.3 está disponível. Esta versão corrige um bug com detecção de gnutls.

source: Version 0.3.0 is released, after 2 years of work and more than 1000 commits! This is a major upgrade since last stable, please read files UPGRADE_0.3 and ChangeLog for list of changes: configuration files and plugin API are not compatible with previous versions. For this important release, site has moved to weechat.org, with a new look! Enjoy WeeChat!
pt_br: A versão 0.3.0 é liberada, após 2 anos de trabalho e mais de 1000 commits! Esta é uma grande atualização desde a última versao estável, por favor leia arquivos UPGRADE_0.3 e o Log de Atualizações (ChangeLog) para uma lista das mudanças: arquivos de configuração e API plugin não são compatíveis com versões anteriores. Para este importante lançamento, o site mudou-se para weechat.org, com um novo visual! Aproveite o WeeChat!

source: Version 0.3.1 is available! As usual, many new features and bug fixes: - new IRC commands: allserv, allchan, sajoin, samode, sanick, sapart, saquit, - check of SSL certificates and use of CertFP for IRC servers, - options to customize IRC CTCP replies, - options to choose target buffer for IRC messages, - anti-flood improved for IRC servers, - new expansions for alias arguments, - new color darkgray, bright colors supported for backgrounds, - many bugs fixed.
pt_br: A versão 0.3.1 está disponível! Como de costume, muitos novos recursos e correções de bugs: - novos comandos IRC: allserv, allchan, sajoin, samode, sanick, sapart, saquit, - verificação de certificados SSL e uso de CertFP para servidores de IRC, - opções para personalizar respostas IRC CTCP, - opções para escolher buffer de destino para mensagens de IRC, - anti-flood aprimorado para servidores IRC, - novas expansões para argumentos de alias, - nova cor darkgray, suporte para cores brilhantes nos fundos, - muitos bugs corrigidos.

source: Version 0.3.1.1 is available! This version fixes crashes with SSL connection to IRC server and purge of old DCC chats. It is recommended to upgrade from 0.3.1 to 0.3.1.1 for all users.
pt_br: A versão 0.3.1.1 está disponível! Esta versão corrige falhas com conexão SSL para o servidor de IRC e expurgo do velho bate-papo DCC. É recomendável a atualização do 0.3.1 para 0.3.1.1 para todos os usuários.

source: Version 0.3.2 is available! As usual, many new features and bug fixes: - SASL authentication with IRC servers, - new commands: mute, map, - command /key improved, - new command line option "-s" to start without script, - plugins autoload improved, - custom completions for aliases, - date allowed in log filenames, - many bugs fixed.
pt_br: A versão 0.3.2 está disponível! Como de costume, muitos novos recursos e correções de bugs: - autenticação SASL com servidores IRC, - novos comandos: mute, map, - comando /key aprimorado, - nova opção de linha de comando "-s" para iniciar sem script, - plugin autoload aprimorado, - completions customizadas para aliases, - data permitida em nomes de arquivos de log, - muitos bugs corrigidos.

source: Version 0.3.3 is available! As usual, many new features and bug fixes: - keys to undo/redo changes on command line, - better lag indicator, - new irc command /wallchops, - display message in irc private buffer when nick is back on server after a /quit, - reverse regex in a filter (with leading "!"), - new option to confirm /quit, - new option to align end of lines, - hashtables in plugin API, - many bugs fixed.
pt_br: A versão 0.3.3 está disponível! Como de costume, muitos novos recursos e correções de bugs: - chaves para desfazer/refazer alterações na linha de comando, - indicador de lag aprimorado, - novo comando irc /wallchops, - exibe mensagem em buffer privado de irc quando o nick está de volta ao servidor depois de um /quit, - regex reverso em um filtro (com os principais "!"), - nova opção para confirmar /quit, - nova opção para alinhar final das linhas, - hashtables na API plugin, - muitos bugs corrigidos.

source: Version 0.3.4 is available! This is a major release, with lot of bugs fixed and major new features. Among the new features: - 256 colors support, with unlimited number of nick colors - irc proxy (relay plugin) - redirection of IRC commands - command /notify - rmodifier plugin - regular expressions for highlights - color support for timestamp in chat buffer - irc option to force color for some nicks - share input line between buffers. For complete list of new features and bugs fixed, please look at <a href="http://dev.weechat.org/post/2011/01/16/Version-0.3.4">development blog</a> or <a href="/files/changelog/ChangeLog-0.3.4.html">ChangeLog</a>.
pt_br: A versão 0.3.4 está disponível! Este é um grande lançamento, com muitos bugs corrigidos e importantes novos recursos. Entre as novas funcionalidades: - suporte para 256 cores, com número ilimitado de nicks coloridos - irc proxy (plugin relay) - redirecionamento de comandos IRC - comando /notify - plugin rmodifier - expressões regulares com destaques - suporte a timestamps coloridos no buffer de bate-papo - opção de irc para forçar cor para alguns nicks - compartilhar linha de entrada entre buffers. Para a lista completa das novas funcionalidades e bugs corrigidos, por favor veja nosso blog em <a href="http://dev.weechat.org/post/2011/01/16/Version-0.3.4">blog de desenvolvimento</a> ou o <a href="/files/changelog/ChangeLog-0.3.4.html">Log de Alterações</a>.

source: Version 0.3.5 is available! This is a major release, with lot of bugs fixed and major new features. Among the new features: - 256 colors support improved (dynamic allocation of colors) - attributes for colors (bold/reverse/underline) - better scroll of input (with long text) - output of /help improved for list of commands and their arguments - remember scroll position of buffers in windows - list of buffers in filters - count of messages in hotlist buffers - swap buffers of windows - balance of windows - new API function to set help on plugin/script options - speller options in aspell plugin - option for SSL priorities in IRC servers - color nicks in nicklist and output of /names. For complete list of new features and bugs fixed, please look at <a href="http://dev.weechat.org/post/2011/05/15/Version-0.3.5">development blog</a> or <a href="/files/changelog/ChangeLog-0.3.5.html">ChangeLog</a>.
pt_br: A versão 0.3.5 está disponível! Este é um grande lançamento, com muitos bugs corrigidos e importantes novos recursos. Entre as novas funcionalidades: - Aprimorado o suporte para 256 cores (alocação dinâmica de cores) - Atributos de cores (negrito/reverso/sublinhado) - Melhor rolo de entrada (com texto longo) - Saída do /help aprimorada para lista de comandos e seus argumentos - Memorização da posição de rolagem dos buffers na janela - Lista de buffers nos filtros - Contagem de mensagens nos buffers hotlist - Permuta de buffers na janela - Janelas equilibradas - Nova função na API para configurar a ajuda nas opções de plugin/script - Opções de ortografia no plugin aspell - Opção para as prioridades SSL em servidores IRC - Nicks coloridos na nicklist e na saída do /nomes Para a lista completa das novas funcionalidades e bugs corrigidos, por favor veja nosso blog em <a href="http://dev.weechat.org/post/2011/05/15/Version-0.3.5">blog de desenvolvimento</a> ou o <a href="/files/changelog/ChangeLog-0.3.5.html">Log de Alterações</a>.

source: Version 0.3.6 is available! This is a major release, with lot of bugs fixed and major new features. Among the new features: - mouse support - cursor mode (free movement of cursor on screen) - contexts for keys - hdata in API (direct access to WeeChat and plugins data) - "inactive" colors for inactive windows and lines in merged buffers - support of merged buffers in /layout, save layout of buffers/windows on /upgrade - horizontal scrolling in buffers with free content - split of outgoing IRC messages - options for "more" chars in bars - bold not used any more for basic colors (if terminal has at least 16 colors) - automatic zoom on current window when terminal becomes too small for windows - new command /repeat - local variable "highlight_regex" in buffers. For complete list of new features and bugs fixed, please look at <a href="http://dev.weechat.org/post/2011/10/22/Version-0.3.6">development blog</a> or <a href="/files/changelog/ChangeLog-0.3.6.html">ChangeLog</a>.
pt_br: Versão 0.3.6 está disponível! Este é um grande lançamento, com muitos bugs corrigidos e principais novos recursos. Entre os novos recursos: - Suporte ao mouse - Modo cursor (livre circulação do cursor na tela) - Contextos de chaves - hdata na API (acesso direto ao WeeChat e aos dados dos plugins) - Cores "inactive" para janelas inativas e linhas em buffers mesclados - Suporte a buffers mesclados no /layout, salva layout de buffers/janelas no /upgrade - Rolagem horizontal em buffers com conteúdo livre - Split das mensagens de saída do IRC - Opções para "more" caracteres nas barras - Negrito não mais usado nas cores básicas (se terminal tem pelo menos 16 cores) - Zoom automático na janela atual quando o terminal se torna muito pequeno para a janela - Novo comando /repeat - Variável local "highlight_regex" em buffers. Para completar a lista de novas funcionalidades e bugs corrigidos, por favor veja em <a href="http://dev.weechat.org/post/2011/10/22/Version-0.3.6">development blog</a> ou <a href="/files/changelog/ChangeLog-0.3.6.html">ChangeLog</a>.

source: Version 0.3.7 is available! This is a major release, with lot of bugs fixed and major new features. Among the new features: - support of Scheme scripts (new plugin "guile") - support of Python 3.x (but version 2.x still recommended) - add "weechat" protocol in relay plugin for remote interfaces, like <a href="http://dev.weechat.org/post/2011/12/25/QWeeChat-Python-Qt-GUI">QWeeChat</a> - new option irc.color.mirc_remap to remap mirc colors in irc messages - new options irc.look.highlight_{server|channel|pv} to customize or disable default nick highlight - new option "capabilities" in irc servers (to enable some client capabilities on connection) - new option weechat.history.max_buffer_lines_minutes to limit buffer history by time - use extended regex in /filter, /ignore and /list - add support of flags in regular expressions and highlight options - add URL transfer in plugin API (with hook_process and hook_process_hashtable) - add translations in japanese - add doc for relay protocol - add developer's guide - many bugs fixed. For complete list of new features and bugs fixed, please look at <a href="http://dev.weechat.org/post/2012/02/26/Version-0.3.7">development blog</a> or <a href="/files/changelog/ChangeLog-0.3.7.html">ChangeLog</a>.
pt_br: Versão 0.3.7 está disponível! Este é um lançamento maior, com muitos bugs corrigidos e novas características. Entre as novas características: - suporte à scripts Scheme (novo plugin "guile") - suporte à Python 3.x (mas versão 2.x ainda é recomendada) - adição do protocolo "weechat" no plugin de retransmissão para interfaces remotas, como <a href="http://dev.weechat.org/post/2011/12/25/QWeeChat-Python-Qt-GUI">QWeeChat</a> - nova opção irc.color.mirc_remap para remapear cores em mensagens irc. - novas opções irc.look.highlight_{server|channel|pv} para customizar ou desabilitar o destaque padrão de apelido - nova opção "capabilities" em servidores irc (para habilitar algumas capacidades do cliente durante a conexão) - nova opção weechat.history.max_buffer_lines_minutes para limtar histórico de buffer por tempo - usa regex estendida em /filter, /ignore e /list - adição de suporte à flags em expressões regulares e opções de destaque - adição de transferência de URL na API de plugin (com hook_process e hook_process_hashtable) - adição de tradução para japonês - adição de documentação para o protocolo de retransmissão - adição do guia de desenvolvimento - muitos bugs corrigidos. Para uma lista completa de novas features e bugs corrigidos, olhe no <a href="http://dev.weechat.org/post/2012/02/26/Version-0.3.7">blog de desenvolvimento</a> ou <a href="/files/changelog/ChangeLog-0.3.7.html">ChangeLog</a>.

source: Version 0.3.8 is available! Among the new features: - add terminal "bracketed paste mode" - add IRC "external" SASL mechanism - improve parsing of IRC channel modes (do not send extra command "MODE" to server) - follow symbolic links for configuration files (*.conf) - new option weechat.look.prefix_same_nick (hide same prefix for multiple consecutive messages from same nick) - add colors for backlog lines - redirect IRC messages from clients to hide output (relay plugin, IRC protocol) - add a connection timeout for child process in hook_connect - fix display bugs and crashes with small windows - fix truncated configuration files (zero-length) after system crash - many bugs fixed. For complete list of new features and bugs fixed, please look at <a href="http://dev.weechat.org/post/2012/06/03/Version-0.3.8">development blog</a> or <a href="/files/changelog/ChangeLog-0.3.8.html">ChangeLog</a>.
pt_br: Versão 0.3.8 está disponível Entre as novas características: - adiciona modo terminal "bracketed paste mode" - adição de mecanismo de SASL "externo" ao IRC - aprimoramento do parsing de modos de canal de IRC (não envia comando extra "MODE" para o servidor) - segue links simbólicos para arquivos de configuração (*.conf) - nova opção weechat.look.prefix_same_nick (esconde prefixo para multiplas mensagens consecutivas do mesmo apelido) - adiciona cores para linhas de backlog - redireciona mensagens IRC de clientes para escounter a saída (plugin de retransmissão, protocolo IRC) - adição de timeout de conexão para processos filhos em hook_connect - corrige bugs de exibição e falhas com janelas pequenas - corrige arquivos de configuração truncados (tamanho zero) após falha de sistema - muitos bugs corrigidos. Para uma lista completa de novas features e bugs corrigidos, olhe no <a href="http://dev.weechat.org/post/2012/06/03/Version-0.3.8">blog de desenvolvimento</a> ou <a href="/files/changelog/ChangeLog-0.3.8.html">ChangeLog</a>.

source: Version 0.3.9 is available! Among the new features: - add plugin "script" (replacement of weeget.py and script.pl) - add support of SSL in relay plugin - add color for offline nicks - add system resource limits for WeeChat process - add zoom on merged buffer (default key: alt+"x") - add "Day changed to" in logger backlog - add command line option "-r" (or "--run-command") to run command(s) after startup of WeeChat - add option "swap" for command /buffer - generate alternate IRC nicks dynamically (when all nicks are already in use) - fix rejoin of password protected IRC channels - fix freeze in irc and relay plugins with sockets - fix color of long lines (displayed on more than one line on screen) under FreeBSD - allow update for some variables of hdata - add japanese user's guide, scripting guide and tester's guide - many bugs fixed. For complete list of new features and bugs fixed, please look at <a href="http://dev.weechat.org/post/2012/09/29/Version-0.3.9">development blog</a> or <a href="/files/changelog/ChangeLog-0.3.9.html">ChangeLog</a>.
pt_br: Versão 0.3.9 está disponível! Entre as novas características: - adição do plugin "script" (substituição de weeget.py e script.pl) - adição de suporte à SSL no plugin de retransmissão - adição de cor para apelindos desconectados - adição de limites para recursos de sistema ao WeeChat - adição de zoom em buffes mesclados (tecla padrão: alt+"x") - adição de "Dia mudado para" no backlog do logger - adição da opção de linha de comando "-r" (ou "--run-command") para rodar comando(s) após a inicialização do WeeChat - adição da opção de "swap" para o comando /buffer - gera apelidos IRC alternativos dinamicamente (quando todos os apelidos já estão em uso) - corrige re-entrada em canais IRC protegidos por password - corrige congelamento nos plugins de irc e retransmissão com sockets - corrige cor de linhas longas (exibidas em mais de uma linha na tela) no FreeBSD - aceita atualização para algumas variáveis de hdata - adição de guia de usuário, guia de scripting e guia de testes em japonês - muitos bugs corrigidos. Para uma lista completa de novas features e bugs corrigidos, olhe no <a href="http://dev.weechat.org/post/2012/09/29/Version-0.3.9">blog de desenvolvimento</a> ou <a href="/files/changelog/ChangeLog-0.3.9.html">ChangeLog</a>.

source: Version 0.3.9.1 is available, it fixes a security problem (buffer overflow when decoding IRC colors in strings). Upgrade is recommended for all users. More information on the <a href="/security">page with security issues</a>.
pt_br: Versão 0.3.9.1 está disponível, ela corrige um problema de segurança (buffer overflow quando decodificando cores IRC em strings). Atualização é recomendada para tudos os usuários. Mais informações na <a href="/security">página de problemas de segurança</a>.

source: Version 0.3.9.2 is available, it fixes a security problem: untrusted command for function hook_process could lead to execution of commands, because of shell expansions. Upgrade is highly recommended for all users. More information on the <a href="/security">page with security issues</a>.
pt_br: Versão 0.3.9.2 está disponível, ela corrige um problema de segurança: comando não confiável para função hook_process pode levar à execução de comandos, devido às expansões de shell. Atualização é altamente recomendável para tudos os usuários. Mais informaçoes na <a href="/security">página de problemas de segurança</a>.

source: Version 0.4.0 is available! Among the new features: - add option "diff" for command /set, display default values in output of /set - add color support in prefix options - add command /eval, use expression in conditions for bars - connect by default with IPv6 to servers with fallback to IPv4 - add aspell suggestions - add support of tags in irc messages and "server-time" capability - add irc command /quiet - add support of IPv6 in relay plugin - add backlog for irc protocol in relay plugin - display remote IP address for DCC chat/file in xfer plugin - add git version in build - many bugs fixed. For complete list of new features and bugs fixed, please look at <a href="http://dev.weechat.org/post/2013/01/20/Version-0.4.0">development blog</a> or <a href="/files/changelog/ChangeLog-0.4.0.html">ChangeLog</a>.
pt_br: Versão 0.4.0 está disponível! Entre as novas características: - adição da opção "diff" para o comando /set, exibe valores padrão na saída de /set - adição de suporte à cores em opções de prefixo - adição do comando /eval, usa expressões em condições para barras - conecta-se por padrão com IPv6 em servidores com fallback para IPv4 - adição de sugestões ortográficas - adição de suporte à tags em mensagens irc e capacidade de "server-time" - adição do comando IRC /quiet - adição de suporte à IPv6 no plugin de retransmissão - adição de backlog para protocolo irc no plugin de retransmissão - exibe endereço IP remoto para chat/arquivo DCC no plugin xfer - adição da versão git na compilação - muitos bugs corrigidos. Para uma lista completa de novas features e bugs corrigidos, olhe no <a href="http://dev.weechat.org/post/2013/01/20/Version-0.4.0">blog de desenvolvimento</a> ou <a href="/files/changelog/ChangeLog-0.4.0.html">ChangeLog</a>.

source: Version 0.4.1 is available! Among the new features: - multiple layouts support - nick prefix/suffix are now dynamic (and managed by core instead of irc plugin) - unmask irc join if nick speaks some minutes after the join - new option irc.look.display_join_message to disable some messages after joining a channel - new option irc.look.pv_buffer to automatically merge private buffers - add support of UHNAMES - add DH-AES encryption method for SASL - multiple irc servers allowed on same port for irc protocol in relay plugin - add WebSocket server support (RFC 6455) in relay plugin (for irc and weechat protocols) - send nicklist difference in relay plugin (weechat protocol) - add control of autoload for scripts - optimizations in aspell plugin - many bugs fixed. For complete list of new features and bugs fixed, please look at <a href="http://dev.weechat.org/post/2013/05/20/Version-0.4.1">development blog</a> or <a href="/files/changelog/ChangeLog-0.4.1.html">ChangeLog</a>.
pt_br: Versão 0.4.1 está disponível! Entre as novas características: - suporte à multiplos layouts - prefixo/sufixo de apelido agora são dinamicos (e gerenciados pelo núcleo ao do plugin irc) - desmascara a entrada irc se o apelido falar alguns minutos após à entrada - nova opção irc.look.display_join_message para desabilitar algumas mensagens após entrar em um canal - nova opção irc.look.pv_buffer para mesclar automaticamente buffers privados - adição de suporte à UHNAMES - adição de método de criptografia DH-AES para SASL - múltiplos servidores irc permitidos na mesma porta para o protocolo irc no plugin de retransmissão - adição de suporte à servidor WebSocket (RFC 6455) no plugin de retransmissão (para protocolos irc e weechat) - envia diferença de lista de apelidos no plugin de retransmissão (weechat protocol) - adição do controle de autocarregamento para scripts - otimizações no plugin de verficiação ortográfica - muitos bugs corrigidos. Para uma lista completa de novas features e bugs corrigidos, olhe no<a href="http://dev.weechat.org/post/2013/05/20/Version-0.4.1">blog de desenvolvimento</a> ou <a href="/files/changelog/ChangeLog-0.4.1.html">ChangeLog</a>.

source: Version v0.1.2 is available! News since last version are: - Python plugin support, Perl interface improved - nicklist scroll keys (Alt+{home/end/pgup/pgdn} or F11/F12) - DCC files transfer rate - buffers timestamp can now be changed - compile is ok under *BSD and Mac OS X - missing IRC commands added (307, 341, 485, 671) - fixed some bugs: crash when purging old DCC, crash with 64-bits arch (like AMD64) when converting UTF-8, nicklist sort. Add-on, 2005-05-24 : fixed crash at startup and Perl/Python detection, version is now 0.1.2.1.
pt_br: A versão v0.1.2 está disponível! Notícias desde a última versão são: - suporte para plugins Python, Perl e interface melhorada - teclas de navegação para Nicklist (Alt+{home/end/pgup/pgdn} ou F11/F12) - taxa de transferência de arquivos DCC - timestamp dos buffers pode agora ser alterado - compilação está ok no *BSD e Mac OS X - adicionados os comandos de IRC em falta (307, 341, 485, 671) - corrigidos alguns bugs: Falha ao descarregar DCC antigo, falha com arquitetura 64-bits (como AMD64) ao converter UTF-8, ordenar nicklist Add-on, 2005/05/24: corrigido crash na inicialização e detecção Perl/Python, a versão agora é 0.1.2.1.
