Repository: 84KaliPleXon3/weechat.org
Catalog: weechat/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Notifications through Net::Growl.
pt_br: Notificações por meio de Net::Growl.

source: Notifications through OS X notification center.
pt_br: Notificações através do centro de notificações do OS X.

source: Notifies the user using pynotify module (just like pidgin/gaim).
pt_br: Notifica o usuário usando o módulo pynotify (assim como pidgin/gaim).

source: Notify of nick highlight via libnotify.
pt_br: Notificar nick highlight (destacado) via libnotify.

source: Notify user about WeeChat updates.
pt_br: Notificar o usuário sobre atualizações do WeeChat.

source: Now-playing script for banshee.
pt_br: Script reproduzindo-agora banshee.

source: Off-The-Record IRC messaging.
pt_br: Troca de mensagens IRC off-the-record.

source: Paste content from X11 clipboard.
pt_br: Colar conteúdo da área de transferência do X11.

source: Permits to auto-authenticate when changing nick.
pt_br: Permite auto-autenticar quando mudando nick.

source: Play a sound for IRC "CTCP SOUND" message.
pt_br: Tocar um som para a mensagem "CTCP SOUND" do IRC.

source: Play a sound when highlighted/private msg, or for ctcp sound event.
pt_br: Tocar um som em msgs privadas/highlighted, ou para evento sonoro ctcp.

source: Play sound when messages are printed in buffers.
pt_br: Reproduzir som quando as mensagens são impressas nos buffers.

source: Popup menu to choose spell checker corrections.
pt_br: Menu popup para escolher correções ortográficas.

source: Postpone written messages for later dispatching if target nick is not on channel.
pt_br: Adiar mensagens escritas para posterior envio se o nick alvo não está no canal.

source: Print a line and additionally set activity level.
pt_br: Imprimir uma linha e, adicionalmente, definir o nível de atividade.

source: Print currently playing track (format is configurable) in xmms2 to a channel or private buffer.
pt_br: Exibe para um canal ou em buffer privado a reprodução atual (formato é configurável) do xmms2.

source: Print highlights or text given by commands into a bar (auto popup if needed).
pt_br: Exibe em uma barra, highlights ou texto dado por comandos (auto pop-up se necessário).

source: Print user's country and local time in whois/whowas replies.
pt_br: Imprimir país do usuário e a hora local no whois / whowas respostas.

source: Prints text with a rainbow pattern.
pt_br: Imprime o texto com um padrão de arco-íris.

source: Prints the machine load average in the infobar.
pt_br: Imprime a média de carga da máquina na barra de informações.

source: Private message white list manager - stop unwanted intrusions.
pt_br: Gerenciador de white list para mensagens - parar intromissões indesejadas.

source: Proper integration of remote users' nicknames in channel and nicklist.
pt_br: Integração apropriada de apelidos de usuário e lista de apelidos em canais remotos.

source: Provides a completion for "s/typo/correct".
pt_br: Fornece auto-completar para "s/typo/correct".

source: Push notification to iPod touch/iPhone with notifo.
pt_br: Envie notificações para iPod touch/iPhone com notifo.

source: Push notification to im.kayac.com.
pt_br: Envia notificação para im.kayac.com.

source: Quick jump to buffers.
pt_br: Pular rápido para buffers.

source: Quick search in command history.
pt_br: Pesquisa rápida no histórico de comandos.

source: Quickly add/del/change entry in option irc.look.nick_color_force.
pt_br: Rapidamente adicione/remova/mude opções em irc.look.nick_color_force.

source: RSS/RDF/Atom feed aggregator.
pt_br: Agregador de feeds RSS/RDF/Atom.

source: Receive notifications in Notify My Android (android phone app).
pt_br: Receber notificações em Notify My Android (aplicativo Android de telefone).

source: Record and correlate nick!user@host information.
pt_br: Registra e correlaciona informações sobre nick!user@host.

source: Recover channel operator in empty channel.
pt_br: Recupera operador de canal em canais vazios.

source: Relay highlighted and private messages over XMPP (Jabber).
pt_br: Relé de mensagens privadas e destacadas sobre XMPP (Jabber).

source: Remove IRC colors from selected buffers.
pt_br: Remove cores IRC de buffers selecionados.

source: Remove messages from a nick and only print nick.
pt_br: Remove as mensagens de um nick e só exibe o nick.

source: Remove options of scripts that are no longer installed.
pt_br: Remove (unset) opções dos scripts que não estão mais instalados.

source: Reopen servers and channels opened last time WeeChat closed.
pt_br: Reabrir servidores e canais abertos da última vez que o WeeChat foi fechado.

source: Replace text in messages.
pt_br: Substituir o texto em mensagens.

source: Replaces text you write with replacement text.
pt_br: Substitui o texto que você escrever com o texto de substituição.

source: Replaces text you write with upside down text.
pt_br: Escreve seu texto de cabeça pra baixo.

source: Retrieve quotes from bash.org.
pt_br: Recuperar citações de bash.org.

source: Roll a random number with different simulated dice combo.
pt_br: Rolar um número aleatório de combinações com diferentes dados simulados.

source: Run Python code directly from WeeChat.
pt_br: Executar código Python diretamente do WeeChat.

source: Run chat received in a buffer as commands.
pt_br: Executar bate-papo recebidos em um buffer de comandos.

source: Run command on highlight and privmsg when away.
pt_br: Executar comando quando estiver away e receber privmsg e highlight.

source: Run shell commands inside WeeChat.
pt_br: Executar comandos shell dentro do WeeChat.

source: Save and restore global and/or buffer command history.
pt_br: Salva e restaura histórico de comandos global e/ou de buffer.

source: Save and restore query buffers after /quit.
pt_br: Salvar/restaurar o layout de buffers de requisição.

source: Save config files in a version control system.
pt_br: Salvar arquivos de configuração em um sistema de controle de versões.

source: Save current buffer content to a file.
pt_br: Salvar o conteúdo do buffer para um arquivo.

source: Save current buffer to a file.
pt_br: Salvar o buffer corrente para um arquivo.

source: Save/restore buffers layout.
pt_br: Salvar/restaurar o layout de buffers.

source: Say all nicknames on current channel.
pt_br: Fala todos os nicks no canal atual.

source: Scans clones on demand on a channel, or on join.
pt_br: Varre clones sob demanda em um canal, ou no join.

source: Script to check if your scripts are up to date with list located at WeeChat website.
pt_br: Script para verificar se seus scripts estão atualizados com a lista localizada no site WeeChat.

source: Scripts manager.
pt_br: Gerenciador de scripts.

source: Search regular expression in buffers or log files.
pt_br: Pesquisa de expressão regular em buffers ou arquivos de log.

source: Search terms on seeks node and display results.
pt_br: Pesquisa termos em nós de busca e mostra resultados.

source: Securely authenticate with QuakeNet by using CHALLENGEAUTH.
pt_br: Autenticação segura com QuakeNet usando CHALLENGEAUTH.

source: Select text, nicks or URLs on screen with mouse or keyboard.
pt_br: Seleciona text, apelidos ou URLs na tela com mouse ou teclado.

source: Send "whois" on nick when receiving new IRC query.
pt_br: Enviar "whois" no nick quando receber uma nova IRC query.

source: Send CTCP ACTIONs as Twitter updates.
pt_br: Enviar CTCP ACTIONs como atualizações no Twitter.

source: Send Growl notifications upon events.
pt_br: Enviar notificações Growl sobre os acontecimentos.

source: Send a colored "kikoo" on current channel.
pt_br: Enviar um "kikoo" colorido no canal atual.

source: Send latest tweet to the current buffer.
pt_br: Envie o último tweet para o buffer atual.

source: Send libnotify notifications with smart delays to avoid spam.
pt_br: Envia notificações libnotify com atrasos inteligentes para evitar spam.

source: Send notice when typing message on bitlbee, display if user is writing in a bar item.
pt_br: Enviar aviso quando escrever mensagens em bitlbee, mostrar em um item da barra se o usuário está escrevendo.

source: Send notice when typing message on minbif, display if user is writing in a bar item.
pt_br: Enviar aviso quando escrever mensagens em minbif, mostrar em um item da barra se o usuário está escrevendo.

source: Send notifications to a ZMQ socket.
pt_br: Enviar notificações para um socket ZMQ.

source: Send notifications to remote client using ssh and libnotify.
pt_br: Envia highlights para o cliente remoto utilizando ssh e libnotify.

source: Send private messages and highlights as push notifications to your iPhone/Android.
pt_br: Enviar mensagens privadas e destacadas (highlights) como notificações push para o iPhone/Android.

source: Send private messages and highlights to an AMQP exchange.
pt_br: Enviar mensagens privadas e hightlights para um AMQP exchange.

source: Send ragefac.es URLs.
pt_br: Enviar URLs ragefac.es.

source: Send raw TCP notify to remote host for highlights and private messages.
pt_br: Enviar raw TCP notify para o host remoto, para mensagens privadas e destacadas.

source: Send text using rainbow colors.
pt_br: Enviar mensagens de texto nas cores do arco-íris.

source: Send your latest Last.fm track to the current buffer.
pt_br: Envie o seu mais recente Last.fm track para o buffer atual.

source: Send/read Twitter messages.
pt_br: Enviar/ler mensagens do Twitter.

source: Sends "uname -a" output to current channel.
pt_br: Envia a saída de "uname -a" para o canal atual.

source: Sends a random fortune cookie.
pt_br: Envia um biscoito da sorte aleatório.

source: Sends greetings in the current channel.
pt_br: Envia saudações no canal atual.

source: Sends highlights to (remote) client using libnotify.
pt_br: Envia highlights para o cliente remoto utilizando libnotify.

source: Sends machine uptime to current channel.
pt_br: Envia uptime da máquina para o canal atual.

source: Sends now-playing informations (fetched from amarok or moc) to the current channel.
pt_br: Envia informações reproduzindo-agora (obtidas a partir do amarok ou moc) para o canal atual.

source: Set Bitlbee's status message with current MPD track.
pt_br: Estabelece a mensagem de status do BitlBee com a música atual do MPD.

source: Set WeeChat and plugins options interactively.
pt_br: Definir as opções do WeeChat e dos plugins de forma interativa.

source: Set away status based on presence of a file.
pt_br: Definir status away baseado na presença de um arquivo.

source: Set away status if slock (X display locker) is running.
pt_br: Definir status como away se slock (X display locker) estiver sendo executado.

source: Set away status when detaching and attaching from screen or tmux.
pt_br: Definir status de away quando attaching e detaching a partir do screen ou tmux.

source: Set channel priority.
pt_br: Definir prioridade do canal.

source: Set terminal title to active buffer name and hotlist items.
pt_br: Definir título do terminal para citar buffer ativo e itens hotlist.

source: Set xfer own ip with external ip.
pt_br: Definir seu próprio xfer ip com ip externo.

source: Sets away after a period of inactivity.
pt_br: Define away após um período de inatividade.

source: Shorten URLs with is.gd.
pt_br: Encurta URLs com is.gd.

source: Shorten URLs with many shortening services.
pt_br: Encurta URLs com muitos serviços de encurtamento.

source: Shorten URLs with own HTTP server.
pt_br: Encurtar URLs com o seu próprio servidor HTTP.

source: Shorten long URLs in buffers and input line.
pt_br: Encurtar as urls longas nos buffers e linha de entrada.

source: Shorten long urls in channels.
pt_br: Encurtar as urls longas nos canais.

source: Shorten long urls using isgd or tinyurl.
pt_br: Encurta urls longas usando isgd ou tinyurl.

source: Show /list results in a common buffer and interact with them.
pt_br: Mostrar resultado de /list em um buffer comum e interagir com eles.

source: Show differences between old and new topics.
pt_br: Mostrar diferenças entre os tópicos antigos e novos.

source: Show highlights and private messages with OSD.
pt_br: Mostrar mensagens privadas e highlights com OSD.

source: Show info about current song in foobar2000.
pt_br: Mostrar informações sobre a música atual em foobar2000.

source: Show info about current song in moc.
pt_br: Mostrar informações sobre música atual no moc.

source: Show volume of data on network interface in a bar.
pt_br: Mostrar numa barra o volume de dados na interface de rede.

source: Show what's playing on your sonata player.
pt_br: Mostra o que está tocando no seu sonata player.

source: Sidebar with list of buffers.
pt_br: Lista dos buffers na barra lateral.

source: Simple autoresponder.
pt_br: Autoresponder simples.

source: Simple blocker for private message (i.e. spam).
pt_br: Bloqueador simples para mensagens privada (por exemplo: spam).

source: Simple remote control of multiplexer (screen or tmux), optionally set away status.
pt_br: Simples controle remoto para o multiplexador (screen ou tmux), opcionalmente, define away status.

source: Simple text shuffler.
pt_br: Shuffler texto simples.

source: Slaps with random messages.
pt_br: Bata (slaps) com mensagens aleatórias.

source: Snake game.
pt_br: Jogo snake.

source: Snarl notifications for highlights.
pt_br: Notificações Snarl (rosnar) para highlights.

source: Sort irc buffers alphabetically.
pt_br: Classificar buffers do irc em ordem alfabética.

source: Sort the output of /list command by user count.
pt_br: Ordenar a saída do comando /list pelo numero de usuários.

source: Speaker beep on highlight/private message.
pt_br: Beep no alto-falante ao receber mensagens privadas/highlights.

source: Start command/program if a user joins a channel you are in.
pt_br: Inicia comando/programa se um usuário junta-se à um canal onde você está.

source: Stick buffer to a window.
pt_br: Prende um buffer à uma janela.

source: Swap two buffers.
pt_br: Permutar dois buffers.

source: System info command.
pt_br: Comando de informações do sistema.

source: Tail any number of files and run any command with line appended.
pt_br: Ligue qualquer número de arquivos e execute qualquer comando com a linha anexada.

source: Tetris-like game.
pt_br: Jogo tipo Tetris.

source: Theme manager for WeeChat.
pt_br: Gerenciador de temas para WeeChat.

source: Thinklight blink on highlight/private message.
pt_br: Pisca o led (ThinkLight) ao receber mensagem privada ou highlight.

source: Time-based scheduler, like cron and at.
pt_br: Programador Time-based, semelhante ao cron e o at.

source: Toggle notifications of normal messages for current buffer.
pt_br: Alterna notificações de mensagens normais para o buffer atual.

source: Transform all your input to uppercase (useful for INTERNATIONAL CAPSLOCK DAY).
pt_br: Transformar todas as suas entradas para maiúsculas (útil para DIA INTERNACIONAL DO CAPSLOCK).

source: Translate string using Google translate API.
pt_br: Converte uma string usando a Google Translate API.

source: Translate words from/to other languages.
pt_br: Traduzir palavras de/para outras línguas.

source: Tray and notification.
pt_br: Bandeja e notificação.

source: Ubus notification.
pt_br: Notificação Ubus.

source: Unread e-mail notification and count from a local Maildir directory.
pt_br: Notificação e contagem de emails não lidos a partir de um diretório Maildir local.

source: Update status messages in various Mac IM programs.
pt_br: Atualizar as mensagens de status em diversos programas de Mac IM.

source: Use the weechat nick colors in the chat area and command line.
pt_br: Use as cores dos apelidos do weechat na área de bate-papo e linha de comando.

source: Vi-like key bindings/commands with normal and insert mode.
pt_br: Comandos e atalhos de teclado parecidos com o do editor Vi, com modos normal e de inserção.

source: WeeChat twitter client.
pt_br: Cliente de twitter para WeeChat.

source: Wmii statusbar notification for highlights.
pt_br: Notificação Wmii na barra de status para highlights.

source: iChat-style timestamps.
pt_br: Timestamps no estilo do iChat.

source: iTunes control and now playing script.
pt_br: Script de controle e reproduzindo-agora para iTunes.

source: Popular script
pt_br: Script popular

source: This field is required.
pt_br: Este campo é obrigatório.

source: This name is invalid.
pt_br: Este nome é inválido.

source: This name already exists, please choose another name (update script content accordingly).
pt_br: Este nome já existe, por favor escolha outro nome (atualize o conteúdo do script em conformidade).

# programming language
source: Language
pt_br: Linguagem

source: Name
pt_br: Nome

source: version of script (only digits or dots)
pt_br: versão do script (somente numeros ou pontos)

source: License
pt_br: Licença

source: license (for example: GPL3, BSD, ...)
pt_br: licença (por exemplo: GPL3, BSD, ...)

source: File
pt_br: Arquivo

source: the script
pt_br: o script

source: Description
pt_br: Descrição

source: Requirements
pt_br: Requisitos

source: optional
pt_br: opcional

source: Your name or nick
pt_br: Seu nome ou nick

source: used for scripts page and git commit
pt_br: usado para página de scripts e commit do git

source: Your e-mail
pt_br: Seu e-mail

source: Comments
pt_br: Comentários

source: optional, not displayed
pt_br: opcional, não exibido

source: Are you a spammer?
pt_br: Você é um spammer?

source: enter "no" if you are not a spammer
pt_br: entrar "no" se você não é um spammer

source: New version
pt_br: Nova versão

source: used for git commit
pt_br: Usado para Git commits

source: changes in this release
pt_br: mudanças nesta versão

source: M j, Y
pt_br: d/m/Y

source: Error 403: forbidden
pt_br: Erro 403: proibido

source: Error 403
pt_br: Erro 403

source: Oh no! This page is forbidden...
pt_br: Oh não! Esta página está proibida...

source: Error 404: page not found
pt_br: Erro 404: página não encontrada

source: Error 404
pt_br: Erro 404

source: Oh no! This page does not exist...
pt_br: Oh não! Esta página não existe...

source: You can go back to WeeChat home with link below,<br />or report broken link to
pt_br: Você pode voltar para o Inicio do WeeChat com o link abaixo,<br />ou reporte link quebrado

source: about
pt_br: sobre

source: Features
pt_br: Características

source: Screenshots
pt_br: Fotos

source: History
pt_br: História

source: Make a donation
pt_br: Faça uma doação

source: donate
pt_br: doar

source: Why your donation matters?
pt_br: Por quê sua doação importa?

source: WeeChat is written by a small group of <strong>volunteers</strong>. Any contribution will show us that the project is appreciated and keep us motivated.
pt_br: WeeChat é escrito por um pequeno grupo de <strong>volunteers</strong>. Qualquer contribuição mostra que o projeto é apreciado e nos mantém motivados.

source: How is your money used?
pt_br: Como seu dinheiro é usado?

source: It is used to pay the <strong>dedicated server</strong>, used for developments, build of packages and hosting of weechat.org.
pt_br: É usado para pagar pelo <strong>servidor dedicado</strong>, usado para desenvolvimentos, construção de pacotes e hospedagem do weechat.org.

source: Click on the Paypal icon below this text and follow instructions.
pt_br: Clique no ícone Paypal abaixo deste texto e siga as instruções.

source: You can leave name and comment, they will be displayed on this page.
pt_br: Você pode deixar URL do site e comentar, eles serão exibidos nesta página.

source: Please note that there is <strong>no advertising</strong> on weechat.org, therefore URLs are not displayed.
pt_br: Por favor note que <strong>não há publicidade</strong> no weechat.org, logo URLs não são exibidas.

source: Date
pt_br: Data

source: Amount
pt_br: Quantia

source: Comment
pt_br: Comentário

source: features
pt_br: características

source: Free software, multi-platform
pt_br: Software livre, multiplataforma

source: WeeChat is a fast, light and extensible chat client, released under the terms of the GNU General Public License version 3.
pt_br: WeeChat é um rápido, leve e extensível cliente de chat, distribuído sob os termos da GNU General Public License versão 3.

source: It was written from scratch, and is <strong>actively developed</strong>.
pt_br: Foi escrito a partir do zero, e é <strong>ativamente desenvolvido</strong>.

source: WeeChat has a text interface and runs on many operating systems, such as:
pt_br: WeeChat possui uma interface de texto e roda em muitos sistemas operacionais, como:

source: Light and extensible
pt_br: Leve e extensível

source: WeeChat is designed to be light and extensible: a <strong>lightweight core</strong> with optional <strong>plugins</strong>.
pt_br: WeeChat é projetado para ser leve e extensível: um <strong>núcleo leve</strong> com <strong>plugins</strong> opcionais.

source: Plugins and scripts can be dynamically loaded and unloaded at any time.
pt_br: Plugins e scripts podem ser carregados e descarregados dinamicamente a qualquer momento.

source: Almost everything is a plugin, for example:
pt_br: Quase tudo é um plugin, por exemplo:

source: Internet Relay Chat (IRC) protocol
pt_br: Protocolo Internet Relay Chat (IRC)

source: API for script languages
pt_br: API para linguagens de script

source: IRC proxy and remote interface
pt_br: Interface de proxy e retransmissor remotos

source: Scripts manager
pt_br: Gerenciador de scripts

source: The future is now!
pt_br: O futuro é agora!

source: WeeChat brings a lot of <strong>innovating features</strong>, which makes it different from other console/terminal based chat clients.
pt_br: WeeChat traz muitas <strong>características inovadoras</strong>, o que faz ele diferente de qualquer outro cliente de chat baseado em console/terminal.

source: Look by yourself (the list is not exhaustive):
pt_br: Veja por você mesmo (a lista não é exaustiva):

source: 256 colors
pt_br: 256 cores

source: Mouse support
pt_br: Suporte à mouse

source: Customizable bars
pt_br: Barras personalizáveis

source: Horizontal/vertical split
pt_br: Divisão horizontal/vertical

source: Dynamic filtering of lines
pt_br: Filtragem dinâmica de linhas

source: Incremental text search
pt_br: Pesquisa de texto incremental

source: FIFO pipe
pt_br: Pipe FIFO

source: Spell checking
pt_br: Verificação ortográfica

source: Remote interfaces
pt_br: Interface remota

source: Upgrade without quitting
pt_br: Atualização sem necessidade de encerramento

source: Full-featured IRC plugin
pt_br: Plugin IRC totalmente capaz

source: IRC plugin implements the protocol as described in the RFCs 1459 and 2812.
pt_br: Plugin IRC implementa o protocolo como descrito nos RFCs 1459 e 2812.

source: It comes with many <strong>built-in features</strong>, such as:
pt_br: Vem com muitas <strong>características embutidas</strong>, como:

source: Multi-servers
pt_br: Multiplos servidores

source: SASL authentication
pt_br: Autenticação SASL

source: Nicklist
pt_br: Lista de apelidos

source: Color for nicks
pt_br: Cores para apelidos

source: Color for away nicks
pt_br: Cores para apelidos de pessoas ausentes

source: Smart filter
pt_br: Filtro inteligente

source: Commands redirection
pt_br: Redirecionamento de comandos

source: Custom CTCP replies
pt_br: Respostas CTCP personalizáveis

source: Lag indicator
pt_br: Indicador de lag

source: DCC (file/chat)
pt_br: DCC (arquivo/chat)

source: External interfaces (graphical or text) can connect to a running WeeChat.
pt_br: Interfaces externas (gráficas ou texto) podem se conectar a um WeeChat em execução.

source: Here is a list of available interfaces:
pt_br: Aqui está uma lista de interfaces disponíveis:

source: Qt interface
pt_br: Interface Qt

source: Documentation and support
pt_br: Documentação e suporte
