Repository: 84KaliPleXon3/weechat.org
Catalog: weechat/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Version 0.0.6 is available! News since last version are: - improved channel highlight (priority to message vs join/part) - fixed bug when opened private win and remote user changes his nick - /query command added (starts private conversation) - IRC messages 476, 477 added - /mode command is now ok and channel flags are displayed in status bar - fixed display bug (text was blinking when scrolling) - CTCP Version reply is now in english only and doesn't show host (security reason).
pt_br: A versão 0.0.6 está disponível! Notícias desde a última versão são: - aprimorado destacar de canais (prioridade para a mensagem vs join/part) - corrigido o bug quando abertas janelas privadas e usuário remoto muda seu nick - comando /query adicionado (iniciar uma conversa privada) - mensagens de IRC 476, 477 adicionadas - comando /mode está ok agora e os flags dos canais são exibidos na barra de status - bug de exibição corrigido (texto estava piscando ao rolar) - versão de resposta CTCP está agora apenas em Inglês e não mostra o host (motivo de segurança).

source: Version 0.0.7 is available! News since last version are: - new channels management, with numbered buffers, - multi-windows management with /window and /buffer commands, - auto jump to buffers with activity (Alt-A), - jump to buffers by number (Alt-number), - unique color for each nick (based on nickname), - history limit (saves memory).
pt_br: A versão 0.0.7 está disponível! Notícias desde a última versão são: - novo gerenciamento de canais, com buffers numerados, - gerenciamento multi-janelas com comandos /window e /buffer, - salto automático para buffers com atividade (Alt-A), - saltar para buffers pelo número (Alt-número), - cor exclusiva para cada nick (com base no nickname), - limite de histórico (economiza memória).

source: Version 0.0.8 is available! News since last version are: - DCC incoming file, - away announced in channels, - logging buffers to disk (optional), - auto-join when kicked (optional), - Ctrl-L key: redraw terminal, - Alt-R key: clear hotlist, - improved or fixed commands: /buffer, /query, /kick, - many bugs fixed.
pt_br: A versão 0.0.8 está disponível! Notícias desde a última versão são: - entrada de arquivo DCC, - away anunciado nos canais, - log de buffers registrado para o disco (opcional), - auto-join quando kickado (opcional), - tecla Ctrl-L: redesenhar terminal, - tecla Alt-R: apagar hotlist, - aprimorado ou corrigido comandos: /buffer, /query, /kick, - muitos bugs corrigidos.

source: Version 0.0.9 is available! News since last version are: - auto reconnection to server when disconnected (and fixed bug: 100% CPU usage after disconnection), - new "/buffer close" command (lets you close a server buffer), - "/notice" command fixed, - colors delete in incoming messages (existing option "look_remove_colors_from_msgs"), - new keys Ctrl-A, Ctrl-E, Ctrl-W, Alt-S, Alt-X, - new setup options: server_autoreconnect, server_autoreconnect_delay, server_command_delay.
pt_br: A versão 0.0.9 está disponível! Notícias desde a última versão são: - reconexão automática ao servidor quando desconectado (e bug corrigido: 100% da CPU após a desconexão), - novo comando "/buffer close" (permite você fechar um buffer do servidor), - corrigido comando "/notice", - apagar cores em mensagens recebidas (opção existente "look_remove_colors_from_msgs"), - novas teclas Ctrl-A, Ctrl-E, Ctrl-W, Alt-S, Alt-X, - novas opções de configuração: server_autoreconnect, server_autoreconnect_delay, server_command_delay.

source: Version 0.1.0 is available! News since last version are: - improved /window command: now split and merge are ok - away nicks are now displayed with another color (new option: "irc_away_check") - added away indicator in status bar - added lag indicator (and auto-disconnect after a delay if important lag) - improved completion: now completes commands arguments (IRC and internal) - improved /set command: empty strings are allowed, new colors, server options can be changed while WeeChat is running - added default away/part/quit messages in config file - new [irc] section in config file - added new options for charset (UTF-8 support) - fixed many memory leaks - fixed commands: /op, /deop, /voice, /devoice, /me, /away - many bugs fixed.
pt_br: A versão 0.1.0 está disponível! Notícias desde a última versão são: - aprimorado o comando /window: agora split e merge estão ok - away nicks agora são exibidos com uma outra cor (nova opção: "irc_away_check") - adicionado indicador de away na barra de status - adicionado indicador de lag (e auto-desligar após um atraso de lag importante) - aprimorado auto-completar: agora completa argumentos de comandos (IRC e internos) - aprimorado comando /set: strings vazias são permitidas, novas cores, opções de servidor pode ser alterada enquanto WeeChat está em execução - adicionado mensagens away/part/quit por padrão no arquivo de configuração - nova seção [irc] no arquivo de configuração - adicionado novas opções de charset (suporte UTF-8) - corrigido muitos vazamentos de memória - corrigido comandos: /op, /deop, /voice, /devoice, /me, /away - muitos bugs corrigidos.

source: Version 0.1.1 is available! News since last version are: - new display engine: doesn't cut words at end of lines - DCC send (file) and DCC chat - FIFO pipe for remote control - connection to IRC server is now made by child process (non blocking) - nicks count for channel buffers - crash dump when WeeChat receives SIGSEGV (Segmentation fault) - new commands: /ban, /unban, /kickban, /halfop, /dehalfop - UnrealIrcd IRC servers support - spanish translation - bugs fixed (display and commands).
pt_br: A versão 0.1.1 está disponível! Notícias desde a última versão são: - novo motor de exibição: não corta as palavras no final das linhas - DCC send (envio de arquivos) e DCC chat (bate-papo) - FIFO pipe para controle remoto - conexões com o servidor de IRC é agora feita por processo filho (sem bloqueio) - contador de nicks para canais dos buffers - despejo de memória quando WeeChat recebe SIGSEGV (Falha de segmentação) - novos comandos: /ban, /unban, /kickban, /halfop, /dehalfop - suporte a servidores UnrealIrcd IRC - tradução espanhol - bugs corrigidos (comandos e exibição).

source: Version 0.1.3 is available! News since last version are: - IPv6 added - SSL added - proxy support added (http, socks4, socks5) - /set command now completed - channels notify now saved in config file - many bugs fixed.
pt_br: A versão 0.1.3 está disponível! Notícias desde a última versão são: - adicionado IPv6 - adicionado SSL - adicionado suporte a proxy (http, socks4, socks5) - comando /set agora completado - notificações de canais agora guardadas no arquivo de configuração - muitos bugs corrigidos.

source: Version 0.1.4 is available! News since last version are: - new keyboard management, fully customizable - DCC timeout and auto resume failed transfers - new color for private messages (in hotlist) - new colors for join and part/quit (arrows) - customizable highlights with irc_highlight var - command /amsg added - channels auto-prefixed by "#" for /join command - added time with seconds in infobar - many bugs fixed.
pt_br: A versão 0.1.4 está disponível! Notícias desde a última versão são: - novo gerenciamento de teclado, totalmente personalizável - timeout DCC e auto retomar as transferências interrompidas - nova cor para mensagens privadas (em hotlist) - novas cores para join e part/quit (setas) - destaque personalizável com a variável irc_highlight - adicionado comando /amsg - canais auto-prefixado por "#" para comandos /join - adicionado tempo com segundos na infobar - muitos bugs corrigidos.

source: Version 0.1.5 is available! News since last version are: - added /ame command (send CTCP action to all channels of all connected servers), - added setting "irc_notice_as_pv" to see notices as pv, - added nicks colors in setup file, - added /ignore and /unignore commands, - signal SIGQUIT is now ignored, - jump to next server now saves current channel buffer for each server, - ctrl-up/ctrl-down keys added to call previous/next command in global history (common to all buffers), - many major bugs fixed.
pt_br: A versão 0.1.5 está disponível! Notícias desde a última versão são: - adicionado comando /ame (envia ação CTCP para todos os canais de todos os servidores conectados), - adicionada configuração "irc_notice_as_pv" para ver avisos como pv, - adicionada as cores dos nicks no arquivo de configuração, - adicionado comandos /ignore e /unignore, - sinal SIGQUIT é agora ignorado, - Saltar para próximo servidor agora salva o buffer do canal atual para cada servidor, - Teclas de ctrl-up/ctrl-down adicionadas para chamar o comando previous/next na história global (comum a todos os buffers), - corrigidos muitos dos principais bugs.

source: Version 0.1.6 is available! News since last version are: - new plugin management: now WeeChat loads/unloads dynamic libraries (.so files under GNU/Linux). Perl and Python become two plugins (script type). Many changes were made, there's some incompatibilities with old scripts, thanks for reading release notes (file NEWS or link below) - config file for plugins - color management in IRC messages (compatible with other IRC clients, including mIrc) - full UTF-8 support - smart hotlist - server mixed on one window (optional) - partial highlights - improved completion, customizable.
pt_br: A versão 0.1.6 está disponível! Notícias desde a última versão são: - novo gerenciamento de plugin: agora WeeChat carrega/descarrega bibliotecas dinâmicas (arquivos .so em GNU/Linux). Perl e Python tornam-se dois plugins (tipo script). Muitas mudanças foram feitas, há algumas incompatibilidades com antigos scripts, obrigado pela leitura das notas de lançamento (arquivo NEWS ou link abaixo) - arquivo de configuração para plugins - gerenciamento de cores em mensagens de IRC (compatível com outros clientes de IRC, incluindo mIRC) - suporte total para UTF-8 - hotlist inteligente - servidores mixados numa única janela (opcional) - textos parcialmente destacados (highlights) - aprimorado o auto-completar, personalizável.

source: Version 0.1.7 is available! News since last version are: - new commands: /upgrade, /uptime, /history - removed "irc_default_msg_away" setting, for RFC 2812 conformity (/away command wihtout argument only removes away status), new values for "irc_display_away" (off, local, channel) - replaced Texinfo doc by XML Docbook - added color for window separators - added completion system for plugins/scripts commands - added charset by server and channel, new command: /charset - added Ruby script plugin - added ETA (Estimated Time of Arrival) for DCC files - /nick command is now allowed when not connected to server - added server/channel arg to /buffer command for jumping to buffer - added new keys for switching to other windows: alt-W followed by alt-arrow - added new keys for scrolling to previous/next highlight: alt-P / alt-N - added "read marker": an indicator for first unread line in a server or channel buffer (new key alt-U to scroll to marker) - new window maganement: custom size for windows, auto resize when terminal is resized - fixed: plugins autoload and unload, some display bugs.
pt_br: A versão 0.1.7 está disponível! Notícias desde a última versão são: - Novos comandos: /upgrade, /uptime, /history - Removido o parâmetro "irc_default_msg_away", por conformidade ao RFC 2812 (o comando /away sem argumento remove apenas o status de away), novos valores para "irc_display_away" (off, local, channel) - substituído Texinfo doc por XML Docbook - adicionada cor para separadores de janelas - adicionado sistema de auto-completar para comandos de plugins/scripts - adicionado charset pelo servidor e canal, novo comando: /charset - adicionado plugin de script Ruby - adicionado ETA (Estimated Time of Arrival / Tempo Estimado de Chegada) para arquivos DCC - comando /nick agora é permitido quando não estiver conectado ao servidor - adicionado argumento server/channel para o comando /buffer para saltar para o buffer - adicionado novas teclas para mudar para outras janelas: alt-W seguido por alt-arrow - adicionado novas teclas de rolagem para texto destacado próximo/anterior: alt-P / alt-N - adicionado "read marker": um indicador para a primeira linha não lida em um buffer do servidor ou canal (nova tecla alt-U para se deslocar até o marcador) - novo gerenciamento de janelas: tamanho personalizado para janelas, ajuste automatico quando o terminal é redimensionado - corrigido: plugins autoload e unload, alguns bugs de exibição.

source: Version 0.1.8 is available! News since last version are: - added IRC raw data buffer (new key: alt-J + alt-R) - keys alt-{home|end} to scroll top/bottom, alt-{f11-f12} to scroll nicklist top/bottom - added new scroll keys for a few lines up/down (default: alt-pgup/pgdn) - added Lua script plugin - improved Ruby plugin - added functions in plugins API: get_server_info, free_server_info, get_channel_info, free_channel_info, get_nick_info, free_nick_info - added special names for plugin message handlers: weechat_pv, weechat_highlight, weechat_ctcp, weechat_dcc - script plugins now load scripts in WeeChat system share directory - added inactivity time, available for plugins via get_info("inactivity") - added new plugins functions: add_timer_handler, remove_timer_handler, remove_infobar - many commands allowed for aliases - many commands allowed when connecting to server - added options "irc_show_away_once", "look_nick_complete_first", "look_open_near_server", "irc_away_check_max_nicks" - added new command line argument for setting WeeChat homedir (-d or --dir) - added partial hungarian translation - improved alias completion (now uses target command for completion) - /msg command does not open any buffer any more (use /query for opening private buffer) - fixed crash when using global history (when older entry is removed) - fixed bug with /upgrade and servers buffer - fixed bug with "get_dcc_info" plugin interface function - many other bugs fixed.
pt_br: A versão 0.1.8 está disponível! Notícias desde a última versão são: - adicionado IRC raw data buffer (nova tecla: alt-J + alt-R) - Teclas alt-{home|end} para rolar topo/base, alt-{f11-f12} para rolar nicklist top/base - adicionada novas teclas de navegação para algumas linhas cima/baixo (default: alt-pgup/pgdn) - adicionado plugin Lua script - aprimorado plugin Ruby - adicionada funções na API plugins: get_server_info, free_server_info, get_channel_info, free_channel_info, get_nick_info, free_nick_info - adicionado nomes especiais para plugins manipuladores de mensagem: weechat_pv, weechat_highlight, weechat_ctcp, weechat_dcc - plugin script agora carrega scripts no WeeChat do diretório compartilhado do sistema - adicionado tempo de inatividade, disponível para plugins via get_info("inactivity") - adicionada novas funções para plugins: add_timer_handler, remove_timer_handler, remove_infobar - muitos comandos permitidos para aliases - muitos comandos permitidos quando conectando ao servidor - adicionadas opções "irc_show_away_once", "look_nick_complete_first", "look_open_near_server", "irc_away_check_max_nicks" - adicionado novo argumento de linha de comando para configuração do WeeChat homedir (-d or --dir) - adicionado tradução parcial para húngaro - aprimorado auto-completar para alias (agora usuários escolhem o comando a ser auto-completado) - comando /msg não abre mais nenhum buffer (use /query para abertura de buffer privado) - corrigido erro quando usava-se o histórico global (quando os antigos eram removidos) - corrigido bug com /upgrade e buffers de servidores - corrigido bug com a função "get_dcc_info" de interface do plugin - Muitos outros bugs corrigidos.

source: Version 0.1.9 is available! News since last version are: - nick alignment, makes channels more readable - new commands: /cycle, /setp - new option to customize IP/hostname (when using multipe IP) - new option to customize input prompt - added keyboard handler for plugins - german translations (messages and documentation) - many bugs fixed for: UTF-8, DCC chat, Ruby, mutiple queries with same name, some commands, long IRC messages (> 512 bytes), terminal refresh, nicklist.
pt_br: A versão 0.1.9 está disponível! Notícias desde a última versão são: - Alinhamento de nick, faz canais mais legíveis - Novos comandos: /cycle, /setp - Nova opção para personalizar IP/hostname (quando se usa IP múltiplos) - Nova opção para personalizar o prompt de entrada - adicionado handler de teclado para plugins - traduções para o alemão (mensagens e documentação) - muitos bugs corrigidos para: UTF-8, bate-papo DCC, Ruby, consultas múltiplas com o mesmo nome, alguns comandos, mensagens IRC longas (> 512 bytes), atualização de terminal, nicklist.

source: Version 0.2.0 is available! News since last version are: - plugin aspell for fixing user typos (language is customizable by channel) - improved DCC speed by adding DCC fast option and sending/receiving in background - added generic function for missing IRC commands - added new functions in plugins API: info about windows, buffers, and buffer content - fixed many IRC commands (wallops and other) - fixed refresh bugs - fixed crashes with DCC - fixed many other bugs.
pt_br: A versão 0.2.0 está disponível! Notícias desde a última versão são: - plugin aspell para a fixação de erros de digitação do usuário (a linguagem é personalizável por canal) - aprimorada a velocidade DCC pela adição da opção rápida DCC e enviar/receber em segundo plano - adicionada a função genérica para os comandos de IRC em falta - adicionada novas funções na API plugins: info sobre janelas, buffers, e conteúdo de buffers - corrigido alguns comandos de IRC (wallops e outros) - corrigido bugs com refresh - corrigidos erros com DCC - corrigidos muitos outros bugs.

source: Version 0.2.1 is available! News since last version are: - added server default notify - added arguments ($1,..,$9) for alias and special vars ($nick, $channel, $server) - added hotlist in session file when using /upgrade command - fixed crash with DCC when resuming file - fixed random crash with /upgrade command - fixed nicklist display when location is top or bottom - fixed bug with CTCP version on channels - fixed bug with auto-rejoin for keyed channels - fixed chan owner and chan admin nicks.
pt_br: A versão 0.2.1 está disponível! As notícias desde a última versão são: - adicionado notificação para o servidor padrão - adicionado argumentos ($1,..,$9) para alias e vars especiais ($nick, $channel, $server) - adicionado hotlist em arquivo de sessão, quando usando comando /upgrade - corrigida a falha com DCC quando resumindo arquivo - corrigido travamento aleatório com comando /upgrade - corrigida a exibição da nicklist quando o local é top ou bottom - corrigido bug com a versão CTCP em canais - corrigido bug com auto-rejoin para canais keyed - corrigido nicks chan owner e chan admin.

source: Version 0.2.2 is available! News since last version are: - added new charset plugin, which replaces internal /charset command: fixes many bugs with charsets, WeeChat internal is now full UTF-8 - added "modifier" in plugins API: plugins are now able to modify or drop received IRC messages - added filename completion - added anti-flood mechanism - added keys to scroll topic - added new option to send unknown IRC commands - improved /plugin command - pdf version of documentation is back - fixed many bugs: portability, memleak in keyboard input, ignore and alias commands, many display bugs.
pt_br: A versão 0.2.2 está disponível! Notícias desde a última versão são: - adicionado novo plugin charset, que substitui o comando interno /charset: corrige muitos bugs com charsets, internamente o WeeChat está agora todo em UTF-8 - adicionado "modifier" na API plugins: plugins agora são capazes de modificar ou largar mensagens recebidas de IRC - adicionado auto-completar para nomes de arquivos - adicionado mecanismo anti-flood - adicionado teclas para rolar o tópico - adicionado nova opção para enviar comandos de IRC desconhecidos - aprimorado o comando /plugin - versão pdf da documentação está de volta - corrigidos muitos bugs: portabilidade, memleak na entrada de teclado, comandos ignore e alias, muitas falhas de exibição.

source: Version 0.2.3 is available! This version fixes major bugs of version 0.2.2. All users of version 0.2.2 should upgrade now. News since last version are: - fixed many bugs with charset plugin - fixed display bugs with nicklist at top/bottom when look_nicklist_separator is OFF - fixed topic scroll when topic has multi-bytes chars - fixed compilation problem with iconv under FreeBSD.
pt_br: A versão 0.2.3 está disponível! Esta versão corrige os principais bugs da versão 0.2.2. Todos os usuários da versão 0.2.2 devem fazer a atualização agora. Notícias desde a última versão são: - corrigido muitos bugs com o plugin charset - corrigido bugs de exibição da nicklist no fundo/topo quando look_nicklist_separator está OFF - corrigido tópico de rolagem quando tópico tem caracteres multi-bytes - corrigido problema de compilação com iconv no FreeBSD.

source: Version 0.2.4 is available! News since last version are: - search in buffer history (ctrl-R) - added "call" option to /key command - added "event handlers" to plugins API - many bugs fixed.
pt_br: A versão 0.2.4 está disponível! Notícias desde a última versão são: - pesquisa na história buffer (ctrl-R) - adicionado opção "call" para o comando /key - adicionado "event handlers" para plugins API - muitos bugs corrigidos.

source: Version 0.2.5 is available! News since last version are: - smart completion (first uses last channel speakers) - added /reconnect command - added %M for completion with current server nicks - added color for text not found in buffer history - many bugs fixed.
pt_br: A versão 0.2.5 está disponível! Notícias desde a última versão são: - auto-completar inteligente (primeiro usa os falantes do último canal) - adicionado comando /reconnect - adicionado %M para auto-completar com nicks do atual servidor - adicionada cor para o texto não encontrado na história do buffer - muitos bugs corrigidos.

source: Version 0.2.6 is available! News since last version are: - new license (GPLv3) - added hotlist sort - added scroll option to /buffer command - added key to jump to previous buffer - fixed bugs with IRC color in messages, now color codes are inserted in command line with ^Cc (Ctrl-C + c), ^Cb,.. instead of %C,%B,.. - improved /server command: now possible to copy and rename servers - improved /connect command: now possible to connect to a temporary server without creating it with /server - many bugs fixed and other new features.
pt_br: A versão 0.2.6 está disponível! Notícias desde a última versão são: - nova licença (GPLv3) - adicionado tipo hotlist - adicionado opção de rolagem para o comando /buffer - adicionado tecla para saltar para o buffer anterior - bugs com a cor em mensagens IRC corrigidos, agora códigos de cores são inseridos na linha de comando com ^Cc (Ctrl-C + c), ^Cb,.. em vez de %C,%B,.. - aprimorado o comando /server: agora é possível copiar e renomear os servidores - aprimorado o comando /connect: agora é possível se conectar a um servidor temporário, sem cria-lo com /server - muitos bugs corrigidos e novos outros recursos.
