Repository: 84KaliPleXon3/weechat.org
Catalog: weechat/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: WeeChat is translated into several languages and has a <a href="%(doc_url)s">comprehensive documentation</a>, also translated.
pt_br: WeeChat é traduzido em diversas linguagens e possui uma <a href="%(doc_url)s">documentação compreensiva</a>, também traduzida.

source: You are new to WeeChat? Read the <strong>quickstart</strong> and <strong>user's</strong> guide.
pt_br: Você é novo ao WeeChat? Leia o <strong>guia rápido</strong> e <strong>guida de usuário</strong>.

source: Got a trivial question? The <strong>FAQ</strong> is waiting for you!
pt_br: Tem uma dúvida trivial? O <strong>FAQ</strong> está esperando por você!

source: You want to write a script for WeeChat? Look at <strong>scripting</strong> guide and <strong>plugin API</strong> reference.
pt_br: Você quer escrever um scriptpara WeeChat? Veja no <strong>guia de scripting</strong> e na <strong>referência de API de plugin</strong>.

source: Your native tongue is C? Then take a look at the <strong>developer's</strong> guide and contribute!
pt_br: Sua língua nativa é C? Então dê uma olhada no <strong>guia de desenvolvedores</strong> e contribua!

source: There is an <a href="%(support_url)s"><strong>excellent support</strong></a> for users. Try it if you have any questions!
pt_br: Existe um <a href="%(support_url)s"><strong>excelente suporte</strong></a> para usuários. Experimente usá-lo se tiver qualquer questão!

source: history
pt_br: histórico

source: Why WeeChat?
pt_br: Por que WeeChat?

source: WeeChat stands for "Wee Enhanced Environment for Chat".
pt_br: WeeChat significa "Wee Enhanced Environment for Chat".

source: In early 2003, I looked for an IRC client with following features:
pt_br: No início de 2003, eu procurei por um cliente de IRC com os seguintes recursos:

source: free software
pt_br: software livre

source: running on Linux
pt_br: rodando em Linux

source: text interface
pt_br: interface de texto

source: real nicklist
pt_br: nicklist reais

source: extensible with scripts written in various languages
pt_br: extensível com scripts escritos em várias linguagens

source: My search was unsuccessful!
pt_br: Minha busca não teve sucesso!

source: Key dates
pt_br: Datas-chave

source: screenshots
pt_br: captura de tela

source: Screenshot not found:
pt_br: Captura de tela não encontrada:

source: No screenshot.
pt_br: Sem capturas de tela.

source: WeeChat, the extensible chat client
pt_br: WeeChat, o cliente de bate-papo extensível

source: Valid
pt_br: Válido

source: Roadmap
pt_br: Roteiro

source: Stats
pt_br: Estatísticas

source: Support
pt_br: Suporte

source: Following infos are available (click on info for the URL):
pt_br: As seguintes informações estão disponíveis (clique na informação para a URL):

source: Current value
pt_br: Valor atual

source: You can fetch these URLs from scripts or other sites.
pt_br: Você pode buscar essas URLs a partir de scripts ou outros sites.

source: roadmap
pt_br: Roteiro

source: Legend:
pt_br: Legenda:

source: one commit in 'master'
pt_br: um commit no 'master'

source: log of a separate branch
pt_br: log de um branch separado

source: Next versions
pt_br: Próximas versões

source: All versions
pt_br: Todas as versões

source: This page lists major features done or planned.
pt_br: ESta página lista as características mais importantes feitas ou planejadas.

source: Dive in the <strong>future</strong> of WeeChat!
pt_br: Mergulhe no <strong>futuro</strong> do WeeChat!

source: Plugin
pt_br: Plugins

source: Planned
pt_br: Planejado

source: Done
pt_br: Concluído

source: statistics
pt_br: estatísticas

source: Git repository:
pt_br: Repositório git:

source: lines of code
pt_br: linhas de código

source: Commits by range:
pt_br: Commits por intervalo:

source: month:
pt_br: mês:

source: year:
pt_br: ano:

source: Charts built with
pt_br: Gráficos construídos com

source: support
pt_br: suporte

source: <strong>Warning:</strong> before asking for help, please read carefully <a href="%(doc_url)s">documentation</a> and <a href="%(faq_url)s">FAQ</a>.
pt_br: <strong>Aviso:</strong> antes de pedir ajuda, leia atentamente a <a href="%(doc_url)s">documentação</a> e <a href="%(faq_url)s">FAQ</a>.

source: Page
pt_br: Página

source: Community
pt_br: Comunidade

source: Mailing list
pt_br: Lista de discussão

source: documentation
pt_br: documentação

source: Stable
pt_br: Estável

source: Devel
pt_br: Desenvolvimento

source: Old versions
pt_br: Versões antigas

source: Docs for old versions
pt_br: Docs para versões antigas

source: <strong>Warning:</strong> these old versions are <strong>not supported</strong> any more!
pt_br: <strong>Atenção:</strong> estas versões antigas <strong>não são mais suportadas</strong>!

source: Docs for version
pt_br: Docs para versão

source: Internationalization stats
pt_br: Estatísticas da internacionalização

# translated language
source: Language
pt_br: Linguagem

source: Translated
pt_br: Traduzido

source: Untranslated
pt_br: Não traduzidas

source: Progress
pt_br: Progresso

source: base language
pt_br: Língua de base

source: statistics for gettext files (*.po), auto-built from development version on
pt_br: estatísticas para arquivos gettext (*.po), auto-construída a partir da versão em desenvolvimento

source: Missing language?
pt_br: Falta idiomas?

source: Feel free to help us by translating WeeChat doc in your language!
pt_br: Sinta-se livre para nos ajudar a traduzir a documentação do WeeChat para o seu idioma!

source: Important
pt_br: Importante

source: Builds by
pt_br: Construção por

source: Latest build:
pt_br: Última construção:

source: Architecture
pt_br: Arquitetura

source: files
pt_br: arquivos

source: No debian repository.
pt_br: Nenhum repositório debian.

source: download
pt_br: baixar

source: Security
pt_br: Segurança

source: Release
pt_br: Notas de lançamento

source: <strong>A new release is under construction!</strong> Follow the progress on <a href="%(download_release_url)s">this page</a>.
pt_br: <strong>Um novo lançamento está em construção!</strong> Siga o progresso <a href="%(download_release_url)s">nesta página</a>.

source: <strong>Warning:</strong> this version may be unstable or it may not compile, you're warned!
pt_br: <strong>Aviso:</strong> esta versão pode ser instável ou pode não compilar, você está avisado!

source: <strong>Warning:</strong> it is not recommended to download any old version, because they are less stable.
pt_br: <strong>Aviso:</strong> não é recomendado baixar qualquer versão antiga, porque eles são menos estáveis.

source: Do it only if you've got problems with latest version and that developers didn't manage to solve your problem!
pt_br: Faça isso somente se você tem problemas com a versão mais recente, e que os desenvolvedores não conseguem resolver o seu problema!

source: <strong>Warning:</strong> this version has a <a href="%(download_security_url)s">vulnerability</a> which is fixed in version
pt_br: <strong>Aviso:</strong> esta versão tem uma <a href="%(download_security_url)s">vulnerabilidade</a> a qual foi consertada na versão

source: Packages
pt_br: Pacotes

source: About release
pt_br: Sobre o lançamento

source: Release notes
pt_br: Notas de lançamento

source: (see above)
pt_br: (veja acima)

source: Checking the signatures
pt_br: Verificando as assinaturas

source: Import the gpg key:
pt_br: Importando a chave gpg:

source: Display the fingerprint:
pt_br: Mostrando o fingerprint:

source: Check that the fingerprint is correct by asking to a developer on #weechat (chat.freenode.net).
pt_br: Verifique que o fingerprint é correto perguntando à um desenvolvedor em #weechat (chat.freenode.net).

source: Trust the key:
pt_br: Confie na chave:

source: In directory with package + signature:
pt_br: No diretório com o pacote + assinatura:

source: If the signature is OK you should see a message like this one:
pt_br: Se a assinatura está OK você deve ser uma mensagem como esta:

source: Savannah page
pt_br: Página Savannah

source: Error: there is no version called
pt_br: Erro: não existe uma versão chamada

source: security
pt_br: segurança

source: Security vulnerabilities
pt_br: Vulnerabilidades de segurança

source: This table contains a list of all known and fixed security vulnerabilities in WeeChat stable releases (the security vulnerabilities introduced during development of a version and fixed before stable release are not mentioned).
pt_br: Esta tabela contém a lista de todas as conhecidas e agora corrigidas vulnerabilidades nos lancaçmentos estáveis do WeeChat (as vulnerabilidades introduzidas durante o desenvolvimento de uma versão e corrigidos antes do lançamento estável não são mencionadas.

source: Note: you can be warned about security vulnerabilities by subscribing to this mailing list:
pt_br: Nota: você pode ser avisado sobre vulnerabilidades de segurança inscrevendo-se nesta lista de emails:

source: External link
pt_br: Link externo

source: Severity
pt_br: Severidade

source: Affected versions
pt_br: Versões afetadas

source: Fixed in version
pt_br: Corrigido na versão

source: Release date
pt_br: Data de lançamento

source: Workaround
pt_br: Correção

source: There is no workaround.
pt_br: Nao há correção.

source: Security vulnerabilities are classified using 4 severity levels:
pt_br: Vulnerabilidades de segurança são classificadas usando 4 níveis de severidade:

source: local problem which occurs in very specific conditions, low impact. Upgrade is not mandatory.
pt_br: problema local que ocorre em condições muito específicas, baixo impacto. Atualização não é obrigatória.

source: problem affecting a specific feature. Upgrade is <strong>recommended</strong> at least for people using the feature.
pt_br: problema afetando uma característica específica. Atualização é <strong>recomendada</strong> pelo menos para pessoas usando aquela característica.

source: severe problem. Upgrade is <strong>highly recommended</strong>.
pt_br: problema severo. Atualização é <strong>altamente recomendada</strong>.

source: critical problem, risk of damage on your system. <strong>You MUST upgrade immediately!</strong>
pt_br: problema crítico, risco de danos no seu sistema. <strong>VocE DEVE atualizar imediatamente!</strong>

source: Back to home
pt_br: Voltar à página inicial

source: About WeeChat
pt_br: Sobre o Weechat

source: WeeChat is a fast, light and extensible chat client.
pt_br: WeeChat é um cliente de bate-papo rápido, leve e extensível.

source: It runs on many platforms like Linux, Unix, BSD, GNU Hurd, Mac OS&nbsp;X and Windows (cygwin).
pt_br: Ele roda em muitas plataformas como Linux, Unix, BSD, GNU Hurd, Mac OS&nbsp;X e Windows (cygwin).

source: WeeChat is:
pt_br: WeeChat é:

source: <strong>modular</strong>: a lightweight core with optional plugins
pt_br: <strong>modular</strong>: um núcleo leve, com plugins opcionais

source: <strong>fully documented</strong> and translated into several languages
pt_br: <strong>totalmente documentado</strong> e traduzidos em muitas línguas

source: <strong>an active project</strong> with a large community for scripts
pt_br: <strong>um projeto ativo</strong> com uma grande comunidade para scripts

source: Latest stable version of WeeChat is
pt_br: A última versão estável do WeeChat é

source: released on
pt_br: lançado em

source: Download
pt_br: Baixar

source: You can help the WeeChat project in many ways:
pt_br: Você pode ajudar o projeto WeeChat de muitas maneiras:

source: <strong>translation</strong>: software, documentation and this web site
pt_br: <strong>tradução</strong>: software, documentação e este web site

source: <strong>code</strong>: tests, bug reports, ideas for new features and patches
pt_br: <strong>código</strong>: testes, reportação de bugs, ideias para novas características e patches

source: <strong>donation</strong>: any contribution is appreciated and important for motivation
pt_br: <strong>doação</strong>: qualquer contribuição é apreciada e importante para motivação

source: More
pt_br: Mais

source: Latest news
pt_br: Últimas notícias

source: Upcoming events
pt_br: Próximos eventos

source: temporarily unavailable
pt_br: temporariamente indisponível

source: This page is under maintenance.
pt_br: Esta página está em manutenção.

source: Page will be back soon, please come back later.
pt_br: Página estará de volta em breve, por favor, volte mais tarde.

source: Thank you for your patience.
pt_br: Obrigado pela sua paciência.

source: Back
pt_br: Voltar

source: Home
pt_br: Página Inicial

source: About
pt_br: Sobre

source: Stable version
pt_br: Versão estável

source: Security issues
pt_br: Problemas de segurança

source: Browse scripts
pt_br: Navegar pelos scripts

source: Add script
pt_br: Adicionar script

source: Update script
pt_br: Atualizar script

source: Pending scripts
pt_br: Scripts pendentes

source: Unofficial scripts
pt_br: Scripts não-oficiais

source: Statistics
pt_br: Estatísticas

source: <strong>Warning:</strong> please follow <strong>all</strong> these rules, otherwise your script will be rejected:
pt_br: <strong>Aviso:</strong> por favor siga <strong>todas</strong> essas regras, caso contrário, seu script será rejeitado:

source: check that no script (or <a href="%(scripts_pending_url)s">pending script</a>) does exactly same thing as your script
pt_br: verifique se não existem scripts (ou <a href="%(scripts_pending_url)s">scripts pendentes</a>) que fazem exatamente a mesma coisa que o seu script

source: unique name (not used by any other script, even in a different language)
pt_br: nome exclusivo (não utilizado por qualquer outro script, mesmo em um idioma diferente)

source: the script name in register function must be exactly same name as script (without extension)
pt_br: o nome do script na função de registro deve ser exatamente o mesmo nome que o script (sem a extensão)

source: no shebang on first line (like '#!/usr/bin/perl'), it's not needed
pt_br: sem shebang na primeira linha (por exemplo '#!/usr/bin/perl'), isso não é necessário

source: no use of extra API between WeeChat and your script (like Ruby gem 'WeeChat'), you must use standard WeeChat API
pt_br: sem o uso de API extra entre WeeChat e seu script (por exemplo Ruby gem 'WeeChat'), você deve usar a API padrão WeeChat

source: if your script is doing something blocking (like fetching URL), you must use function hook_process (or hook_process_hashtable) to not block WeeChat
pt_br: se o seu script está bloqueando algo (como buscar URL), você deve usar a função hook_process (ou hook_process_hashtable) para não bloquear o WeeChat

source: Submit
pt_br: Entregar

source: Oops... Something went wrong while processing the form :(
pt_br: Ops... Alguma coisa saiu errada processando o formulário :(

source: You can try again or report problem to webmaster if the problem persists.
pt_br: Você pode tentar novamente ou reportar o problema para o webaster se o problema persistir.

source: Back to form
pt_br: Voltar ao formulário

source: You'll be informed if there is a problem with your script.
pt_br: Você será informado se existir um problema com o script.

source: Back to scripts
pt_br: Voltar para scripts

source: <strong>Warning:</strong> these scripts are written by external contributors, therefore WeeChat developers are <strong>NOT RESPONSIBLE</strong> for problems caused by one of these scripts.
pt_br: <strong>Aviso:</strong> esses scripts são escritos por colaboradores externos, por isso os desenvolvedores do WeeChat <strong>NÃO SE RESPONSABILIZAM</strong> por problemas causados ​​por um desses scripts.

source: You could experience problems like memory leaks, slowdowns, or even <strong>security problems</strong>. You are warned!
pt_br: Você poderá ter problemas como vazamentos de memória, lentidão, ou até mesmo <strong>problemas de segurança</strong>. Você está avisado!

source: Display scripts for stable API (&ge; 0.3.0)
pt_br: Scripts de exibição para API estável (&ge; 0.3.0)

source: XML list
pt_br: lista XML

source: Version:
pt_br: Versão:

source: filter:
pt_br: filtro:

source: remove
pt_br: remover

source: no filter
pt_br: sem filtro

source: Search by tag:
pt_br: Busca por tag:

source: Author
pt_br: Autor

source: Added
pt_br: Adicionado

source: Updated
pt_br: Atualizado

source: requires
pt_br: requer

source: Author:
pt_br: Autor:

source: No script found.
pt_br: Nenhum script encontrado.

source: Following scripts are waiting for approval, possible future is:
pt_br: Scripts a seguir estão aguardando aprovação, a previsão é:

source: if script is OK, it is moved to official scripts and git repository.
pt_br: se o script está OK, ele é movido para Oficial Scripts e repositório git.

source: if script does not meet all requirements, it is moved to unofficial scripts.
pt_br: se o script não atende todos os requisitos, ele é movido para Scripts não Oficiais.

source: if script is rejected, it is deleted.
pt_br: se o script é rejeitado, ele será excluído.

source: We need your help!
pt_br: Precisamos da sua ajuda!

source: You can help us by testing these scripts. Please report bugs to author of script and to
pt_br: Você pode nos ajudar testando esses scripts. Por favor, relate erros para o autor do script e para

source: Approval notes
pt_br: Notas de aprovação

source: No script pending approval at this time.
pt_br: Nenhuma aprovação pendente de scripts para o momento.

source: for WeeChat
pt_br: para Weechat

source: version
pt_br: versão

source: added
pt_br: adicionado

source: updated
pt_br: atualizado

source: Script not found
pt_br: Script não encontrado

source: for a Python script with tag "py3k-ok", please ensure your new version is compatible with Python 2.x and 3.x
pt_br: para um script em Python com a tag "py3k-ok", por favor tenha certeza que a sua nova versão é compatível com Python 2.x e 3.x

source: New release has been submitted for review.
pt_br: Nova versão foi submetida para análise.

source: <strong>Warning:</strong> please follow <strong>all</strong> these rules, otherwise your theme will be rejected:
pt_br: <strong>Aviso:</strong> por favor siga <strong>todas</strong> essas regras, caso contrário, seu tema será rejeitado:

source: unique name, ending with '.theme' (only letters, digits or '_')
pt_br: nome único, terminado com '.theme' (somente letras, dígitos ou '_')

source: theme must be built with latest stable version of WeeChat
pt_br: tema deve ser construído com a mais recente versão estável do WeeChat

source: or development version
pt_br: ou versão de desenvolvimento

source: Your theme was submitted for review, it usually takes 24 or 48 hours (several weeks if many themes are pending).
pt_br: Seu script foi apresentado para análise, normalmente leva 24 ou 48 horas (até uma ou duas semanas se muitos scripts estão pendentes).

source: You'll be informed if there is a problem with your theme.
pt_br: Você será informado se existir um problema com seu tema.

source: Back to themes
pt_br: Voltar para temas

source: <strong>Warning:</strong> alpha version of themes! Alpha version of script is available here:
pt_br: <strong>Aviso:</strong> versão alfa dos temas! A versão alfa do script está disponível aqui:

source: submitted by
pt_br: postado por

source: No theme found.
pt_br: Nenhum tema encontrado.

source: Theme
pt_br: Tema

source: Theme not found
pt_br: Tema não encontrado

source: themes
pt_br: temas

source: Themes
pt_br: Temas

source: Add theme
pt_br: Adicionar tema

source: Update theme
pt_br: Atualizar tema

source: Updated theme has been submitted for review.
pt_br: Nova versão do tema foi submetida para análise.

source: the theme
pt_br: o tema

source: no spam, never displayed on site
pt_br: sem spam, nunca exibido no site

source: Theme file too big.
pt_br: Arquivo de tema muito grande.

source: Invalid theme file.
pt_br: Arquivo de tema inválido.

source: This name already exists.
pt_br: Este nome já existe.

source: Invalid name inside theme file.
pt_br: Nome inválido dentro do arquivo de tema.

source: Invalid WeeChat version, too old!
pt_br: Versão WeeChat inválida, muito antiga!

source: Internal error.
pt_br: Erro interno.

source: Invalid name: different from theme.
pt_br: Nome inválido: diferente do tema.
